RhinoCommon SDK
RealtimeDisplayMode.HudPauseButtonPressed Event
 Listen tot his event if you want to handle the pause button control
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public event EventHandler HudPauseButtonPressed
Public Event HudPauseButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace