RhinoCommon SDK
AnnotationBase.m_doc_serialnumber Field
[Missing <summary> documentation for "F:Rhino.Geometry.AnnotationBase.m_doc_serialnumber"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected uint m_doc_serialnumber
Protected m_doc_serialnumber As UInteger
Field Value
Type: UInt32
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace