RhinoCommon SDK
AnnotationBase Fields
The AnnotationBase type exposes the following members.
Fields
Name | Description
m_doc_serialnumber
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace