RhinoCommon SDK
LightArray.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.LightArray.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
LightArray Class
Rhino.Render Namespace