RhinoCommon SDK
Components Constructor
Initializes a new instance of the Components class
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Components()
Protected Sub New
See Also
Reference
Components Class
Rhino.Grasshopper Namespace