RhinoCommon SDK
AnnotationBase Constructor (SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected AnnotationBase(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
AnnotationBase Class
AnnotationBase Overload
Rhino.Geometry.V6Annotation Namespace