RhinoCommon SDK
DimStyleTable.Modify Method (DimensionStyle, AnnotationBase)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.V6Annotation.AnnotationBase)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ModifyType Modify(
	DimensionStyle dimstyle,
	AnnotationBase annotation
)
Public Function Modify (
	dimstyle As DimensionStyle,
	annotation As AnnotationBase
) As ModifyType
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.V6Annotation.AnnotationBase)"]
annotation
Type: Rhino.Geometry.V6Annotation.AnnotationBase
[Missing <param name="annotation"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.V6Annotation.AnnotationBase)"]
Return Value
Type: ModifyType
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.V6Annotation.AnnotationBase)"]
See Also
Reference
DimStyleTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace