RhinoCommon SDK
GroupTable.FindName Method
 Finds a Linetype given its name.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Group FindName(
	string name
)
Public Function FindName (
	name As String
) As Group
Parameters
name
Type: System.String
The name of the Linetype to be searched.
Return Value
Type: Group
An Linetype, or null on error.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace