RhinoCommon SDK
RealtimeDisplayMode.IsRendererStarted Method
 Override to tell the started state of your render engine.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsRendererStarted()
Public Overridable Function IsRendererStarted As Boolean
Return Value
Type: Boolean
true if render engine is ready and rendering
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace