RhinoCommon SDK
ThumbnailListImpl.Dispose Method
Releases all resources used by the ThumbnailListImpl
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace