RhinoCommon SDK
Centermark.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Centermark Create(
	Guid styleId,
	Plane plane,
	Point3d centerpoint,
	double radius
)
Public Shared Function Create (
	styleId As Guid,
	plane As Plane,
	centerpoint As Point3d,
	radius As Double
) As Centermark
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Centermark
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
Centermark Class
Rhino.Geometry.V6Annotation Namespace