RhinoCommon SDK
RenderContent.IsFactoryProductAcceptableAsChild Method
 Override this method to restrict the type of acceptable child content. The default implementation of this method just returns true.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsFactoryProductAcceptableAsChild(
	Guid kindId,
	string factoryKind,
	string childSlotName
)
Public Overridable Function IsFactoryProductAcceptableAsChild (
	kindId As Guid,
	factoryKind As String,
	childSlotName As String
) As Boolean
Parameters
kindId
Type: System.Guid
[Missing <param name="kindId"/> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)"]
factoryKind
Type: System.String
[Missing <param name="factoryKind"/> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)"]
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)"]
Return Value
Type: Boolean
 Return true only if content with the specified kindId can be accepted as a child in the specified child slot.
See Also
Reference
RenderContent Class
Rhino.Render Namespace