RhinoCommon SDK
ChangeQueue.EnvironmentForid Method
 Get RenderEnvironment for given RenderHash
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderEnvironment EnvironmentForid(
	uint crc
)
Public Function EnvironmentForid (
	crc As UInteger
) As RenderEnvironment
Parameters
crc
Type: System.UInt32
[Missing <param name="crc"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentForid(System.UInt32)"]
Return Value
Type: RenderEnvironment
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentForid(System.UInt32)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace