RhinoCommon SDK
NodeInCodeTable.TryGetMember Method
 Dynamically binds the table to property-like access via its item names.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool TryGetMember(
	GetMemberBinder binder,
	out Object result
)
Public Overrides Function TryGetMember (
	binder As GetMemberBinder,
	<OutAttribute> ByRef result As Object
) As Boolean
Parameters
binder
Type: System.Dynamic.GetMemberBinder
The dynamic binder.
result
Type: System.Object
Returns the result.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Grasshopper.NodeInCodeTable.TryGetMember(System.Dynamic.GetMemberBinder,System.Object@)"]
See Also
Reference
NodeInCodeTable Class
Rhino.Grasshopper Namespace