RhinoCommon SDK
ObjectTable.Replace Method (ObjRef, AnnotationText)
Replaces one object with new text object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Replace(
	ObjRef objref,
	AnnotationText text
)
Public Function Replace (
	objref As ObjRef,
	text As AnnotationText
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
text
Type: Rhino.Geometry.AnnotationText
new text to be added. The text is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace