RhinoCommon SDK
AnnotationObjectBase.AnnotationGeometry Method
 utility function to be replaced after a proper V6 AnnotationObjectBase is added
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static AnnotationBase AnnotationGeometry(
	RhinoObject aob
)
Public Shared Function AnnotationGeometry (
	aob As RhinoObject
) As AnnotationBase
Parameters
aob
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="aob"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.AnnotationGeometry(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: AnnotationBase
[Missing <returns> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.AnnotationGeometry(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace