RhinoCommon SDK
HatchPatternTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<HatchPattern> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of HatchPattern)
Return Value
Type: IEnumerator<HatchPattern>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace