RhinoCommon SDK
Dimension Constructor
Initializes a new instance of the Dimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Dimension()
Protected Sub New
See Also
Reference
Dimension Class
Dimension Overload
Rhino.Geometry.V6Annotation Namespace