RhinoCommon SDK
RdkViewModel.Dispose Method
Releases all resources used by the RdkViewModel
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace