RhinoCommon SDK
RenderContent.RenderHashExclude Method
 As RenderHash, but ignore parameter names given.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint RenderHashExclude(
	TextureRenderHashFlags flags,
	string excludeParameterNames
)
Public Function RenderHashExclude (
	flags As TextureRenderHashFlags,
	excludeParameterNames As String
) As UInteger
Parameters
flags
Type: Rhino.Render.TextureRenderHashFlags
Flags to ignore
excludeParameterNames
Type: System.String
semicolon-delimited string
Return Value
Type: UInt32
Render hash
See Also
Reference
RenderContent Class
Rhino.Render Namespace