RhinoCommon SDK
DisplayModeDescription.ImportFromFile Method
 Imports a DisplayModeDescription from a Windows-style .ini file.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid ImportFromFile(
	string filename
)
Public Shared Function ImportFromFile (
	filename As String
) As Guid
Parameters
filename
Type: System.String
The name of the file to import.
Return Value
Type: Guid
The id of the DisplayModeDescription if successsful.
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace