RhinoCommon SDK
RealtimeDisplayMode.StartRenderer Method
 Override to start your render engine
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool StartRenderer(
	uint w,
	uint h,
	RhinoDoc doc,
	ViewInfo view,
	ViewportInfo viewportInfo,
	bool forCapture,
	RenderWindow renderWindow
)
Public Overridable Function StartRenderer (
	w As UInteger,
	h As UInteger,
	doc As RhinoDoc,
	view As ViewInfo,
	viewportInfo As ViewportInfo,
	forCapture As Boolean,
	renderWindow As RenderWindow
) As Boolean
Parameters
w
Type: System.UInt32
[Missing <param name="w"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
h
Type: System.UInt32
[Missing <param name="h"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
viewportInfo
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewportInfo"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
forCapture
Type: System.Boolean
[Missing <param name="forCapture"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
renderWindow
Type: Rhino.Render.RenderWindow
[Missing <param name="renderWindow"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)"]
Return Value
Type: Boolean
true when your render engine started correctly, false when that failed
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace