RhinoCommon SDK
ChangeQueue.Flush Method
 Tell the ChangeQueue to flush all collected events.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Flush()
Public Sub Flush
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace