RhinoCommon SDK
ICommonComponentTable<T>.FindIndex Method
 Retrieves an object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
T FindIndex(
	int index
)
Function FindIndex (
	index As Integer
) As T
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: T
A model component, or null if none was found.
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace