RhinoCommon SDK
LightManagerSupport.OnEditLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupport.OnEditLight(Rhino.Render.LightArray)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void OnEditLight(
	LightArray lights
)
Public Sub OnEditLight (
	lights As LightArray
)
Parameters
lights
Type: Rhino.Render.LightArray
[Missing <param name="lights"/> documentation for "M:Rhino.Render.LightManagerSupport.OnEditLight(Rhino.Render.LightArray)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace