RhinoCommon SDK
LightManagerSupport.PluginId Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupport.PluginId"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract Guid PluginId()
Public MustOverride Function PluginId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupport.PluginId"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace