RhinoCommon SDK
RhinoObject.TryGetRenderPrimitiveBoundingBox Method
 Get the bounding box for the custom render meshes associated with this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TryGetRenderPrimitiveBoundingBox(
	ViewportInfo viewport,
	bool preview,
	out BoundingBox boundingBox
)
Public Function TryGetRenderPrimitiveBoundingBox (
	viewport As ViewportInfo,
	preview As Boolean,
	<OutAttribute> ByRef boundingBox As BoundingBox
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build, if preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
boundingBox
Type: Rhino.Geometry.BoundingBox
 This will be set to BoundingBox.Unset on failure otherwise it will be the bounding box for the custom render meshes associated with this object.
Return Value
Type: Boolean
 Returns true if the bounding box was successfully calculated otherwise returns false on error.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace