RhinoCommon SDK
Sun.SetDateTime Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.SetDateTime(System.DateTime,System.DateTimeKind)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetDateTime(
	DateTime time,
	DateTimeKind kind
)
Public Sub SetDateTime (
	time As DateTime,
	kind As DateTimeKind
)
Parameters
time
Type: System.DateTime
[Missing <param name="time"/> documentation for "M:Rhino.Render.Sun.SetDateTime(System.DateTime,System.DateTimeKind)"]
kind
Type: System.DateTimeKind
[Missing <param name="kind"/> documentation for "M:Rhino.Render.Sun.SetDateTime(System.DateTime,System.DateTimeKind)"]
See Also
Reference
Sun Class
Rhino.Render Namespace