RhinoCommon SDK
SceneServerData.Dispose Method
 Dispose for SceneServerData
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
See Also
Reference
SceneServerData Class
Rhino.Render Namespace