RhinoCommon SDK
FileReference.Finalize Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileReference.Finalize"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
FileReference Class
Rhino.FileIO Namespace