RhinoCommon SDK
RenderWindow.Size Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.Size"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Size Size()
Public Function Size As Size
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.Size"]
See Also
Reference
RenderWindow Class
Rhino.Render Namespace