RhinoCommon SDK
OrdinateDimension.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static OrdinateDimension Create(
	Guid styleId,
	Plane plane,
	OrdinateDimension.MeasuredDirection direction,
	Point3d basepoint,
	Point3d defpoint,
	Point3d leaderpoint,
	double kinkoffset1,
	double kinkoffset2
)
Public Shared Function Create (
	styleId As Guid,
	plane As Plane,
	direction As OrdinateDimension.MeasuredDirection,
	basepoint As Point3d,
	defpoint As Point3d,
	leaderpoint As Point3d,
	kinkoffset1 As Double,
	kinkoffset2 As Double
) As OrdinateDimension
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
direction
Type: Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection
[Missing <param name="direction"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
basepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="basepoint"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
defpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
leaderpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="leaderpoint"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
kinkoffset1
Type: System.Double
[Missing <param name="kinkoffset1"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
kinkoffset2
Type: System.Double
[Missing <param name="kinkoffset2"/> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
Return Value
Type: OrdinateDimension
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6Annotation.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)"]
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace