RhinoCommon SDK
ObjectTable.AddRichText Method (TextEntity, ObjectAttributes)
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRichText(
	TextEntity richText,
	ObjectAttributes attributes
)
Public Function AddRichText (
	richText As TextEntity,
	attributes As ObjectAttributes
) As Guid
Parameters
richText
Type: Rhino.Geometry.V6Annotation.TextEntity
Rich text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.V6Annotation.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRichText Overload
Rhino.DocObjects.Tables Namespace