RhinoCommon SDK
Leader Constructor
 Constructor
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Leader()
Public Sub New
See Also
Reference
Leader Class
Rhino.Geometry Namespace