RhinoCommon SDK
OrdinateDimension Constructor
Initializes a new instance of the OrdinateDimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public OrdinateDimension()
Public Sub New
See Also
Reference
OrdinateDimension Class
OrdinateDimension Overload
Rhino.Geometry.V6Annotation Namespace