RhinoCommon SDK
RdkViewModel.GetData Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.GetData(System.Guid,System.Boolean)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Object GetData(
	Guid uuidDataType,
	bool bForWrite
)
Public Function GetData (
	uuidDataType As Guid,
	bForWrite As Boolean
) As Object
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.GetData(System.Guid,System.Boolean)"]
bForWrite
Type: System.Boolean
[Missing <param name="bForWrite"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.GetData(System.Guid,System.Boolean)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.Controls.RdkViewModel.GetData(System.Guid,System.Boolean)"]
Implements
IRdkViewModel.GetData(Guid, Boolean)
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace