RhinoCommon SDK
NodeInCodeTable Constructor
 Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public NodeInCodeTable(
	IEnumerable<ComponentFunctionInfo> items
)
Public Sub New (
	items As IEnumerable(Of ComponentFunctionInfo)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<ComponentFunctionInfo>
Items.
See Also
Reference
NodeInCodeTable Class
Rhino.Grasshopper Namespace