RhinoCommon SDK
MaterialTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<Material> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of Material)
Return Value
Type: IEnumerator<Material>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace