RhinoCommon SDK
CommonComponentTable<T>.FindIndex Method
 Uses the index to find a model component. The index is the value that is stored in the .Index property. This type of search is discouraged. We are moving towards using IDs for all tables.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual T FindIndex(
	int index
)
Public Overridable Function FindIndex (
	index As Integer
) As T
Parameters
index
Type: System.Int32
Index of model component to search for.
Return Value
Type: T
Reference to the rhino object or null if no such object could be found.
Implements
ICommonComponentTable<T>.FindIndex(Int32)
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace