RhinoCommon SDK
ThumbnailListImpl.Get Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.Get(System.Guid@)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IRhRdkThumbnail Get(
	ref Guid u
)
Public Function Get (
	ByRef u As Guid
) As IRhRdkThumbnail
Parameters
u
Type: System.Guid
[Missing <param name="u"/> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.Get(System.Guid@)"]
Return Value
Type: IRhRdkThumbnail
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.Get(System.Guid@)"]
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace