RhinoCommon SDK
FileSvg Constructor
Initializes a new instance of the FileSvg class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected FileSvg()
Protected Sub New
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace