RhinoCommon SDK
ComponentFunctionInfo.EvaluateTreeSilenceWarnings Method
 Infrastructure method that simplifies output and performs warning checks.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Object[] EvaluateTreeSilenceWarnings(
	IEnumerable args
)
Protected Function EvaluateTreeSilenceWarnings (
	args As IEnumerable
) As Object()
Parameters
args
Type: System.Collections.IEnumerable
Arguments.
Return Value
Type: Object[]
Items.
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace