RhinoCommon SDK
RealtimeDisplayMode.HudAllowEditMaxPasses Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudAllowEditMaxPasses"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool HudAllowEditMaxPasses()
Public Overridable Function HudAllowEditMaxPasses As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudAllowEditMaxPasses"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace