RhinoCommon SDK
RealtimeDisplayMode.SetUseLinearWorkflowGamma Method
 Set whether linear workflow is used.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetUseLinearWorkflowGamma(
	bool useLinearWorkflowGamma
)
Public Sub SetUseLinearWorkflowGamma (
	useLinearWorkflowGamma As Boolean
)
Parameters
useLinearWorkflowGamma
Type: System.Boolean
[Missing <param name="useLinearWorkflowGamma"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.SetUseLinearWorkflowGamma(System.Boolean)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace