RhinoCommon SDK
Centermark Constructor
Initializes a new instance of the Centermark class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Centermark()
Public Sub New
See Also
Reference
Centermark Class
Centermark Overload
Rhino.Geometry.V6Annotation Namespace