RhinoCommon SDK
ObjectTable.AddRLeader Method (Leader, ObjectAttributes, HistoryRecord, Boolean)
 Adds a Leader object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRLeader(
	Leader leader,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddRLeader (
	leader As Leader,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
leader
Type: Rhino.Geometry.V6Annotation.Leader
The leader object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to rich text.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRLeader Overload
Rhino.DocObjects.Tables Namespace