RhinoCommon SDK
AsyncRenderContext.JoinRenderThread Method
 Join the render thread, then set to null;
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void JoinRenderThread()
Public Sub JoinRenderThread
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace