RhinoCommon SDK
FileSvg.WriteImpl Method
 Write svg to a file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected abstract void WriteImpl(
	ViewCaptureSettings settings,
	string filename
)
Protected MustOverride Sub WriteImpl (
	settings As ViewCaptureSettings,
	filename As String
)
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.FileIO.FileSvg.WriteImpl(Rhino.Display.ViewCaptureSettings,System.String)"]
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FileSvg.WriteImpl(Rhino.Display.ViewCaptureSettings,System.String)"]
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace