RhinoCommon SDK
RenderWindow.GetAdjust Method
 Get an ImageAdjust instance containing current image adjusting settings for this RenderWindow
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderWindow.ImageAdjust GetAdjust()
Public Function GetAdjust As RenderWindow.ImageAdjust
Return Value
Type: RenderWindow.ImageAdjust
ImageAdjust
See Also
Reference
RenderWindow Class
Rhino.Render Namespace