RhinoCommon SDK
LightManagerSupport.ObjectFromLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupport.ObjectFromLight(Rhino.Geometry.Light)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject ObjectFromLight(
	Light light
)
Public Function ObjectFromLight (
	light As Light
) As RhinoObject
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupport.ObjectFromLight(Rhino.Geometry.Light)"]
Return Value
Type: RhinoObject
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupport.ObjectFromLight(Rhino.Geometry.Light)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace