RhinoCommon SDK
RhinoObject.UnselectAllSubObjects Method
 Removes selection from all subobjects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int UnselectAllSubObjects()
Public Function UnselectAllSubObjects As Integer
Return Value
Type: Int32
The number of unselected subobjects.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace