RhinoCommon SDK
TextEntity.GetTextTransform Method
 Get the transform for this text object's text geometry
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform GetTextTransform(
	double textscale,
	DimensionStyle dimstyle
)
Public Function GetTextTransform (
	textscale As Double,
	dimstyle As DimensionStyle
) As Transform
Parameters
textscale
Type: System.Double
[Missing <param name="textscale"/> documentation for "M:Rhino.Geometry.V6Annotation.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.V6Annotation.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
TextEntity Class
Rhino.Geometry.V6Annotation Namespace