RhinoCommon SDK
MenuTask.Query Method
 Query if the task should be displayed to the user in a menu etc. The default implementation returns the result of calling origin.SupportsTask()
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Query(
	MenuTaskOrigin origin,
	bool bOnItem
)
Public Function Query (
	origin As MenuTaskOrigin,
	bOnItem As Boolean
) As Boolean
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
origin represents the UI that the menu was invoked in.
bOnItem
Type: System.Boolean
bOnItem is \e true if the user right-clicked on one or more items (thumbnail, tree node etc).
Return Value
Type: Boolean
\e true if a UI element (e.g., a menu item) should be created for the task, else \e false.
See Also
Reference
MenuTask Class
Rhino.Render Namespace