RhinoCommon SDK
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
extpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="extpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
extpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="extpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dirpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="dirpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dirpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="dirpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry.V6Annotation Namespace