RhinoCommon SDK
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
defpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
defpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry.V6Annotation Namespace