RhinoCommon SDK
RealtimeDisplayMode.HudShowStatusText Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudShowStatusText"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool HudShowStatusText()
Public Overridable Function HudShowStatusText As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudShowStatusText"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace