RhinoCommon SDK
BitmapTable.GetEnumerator Method
 BitmapTable enumerator
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<BitmapEntry> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of BitmapEntry)
Return Value
Type: IEnumerator<BitmapEntry>
An enumerator.
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace