RhinoCommon SDK
NodeInCodeTable.GetDynamicMemberNames Method
 Returns all additional names in the table.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerable<string> GetDynamicMemberNames()
Public Overrides Function GetDynamicMemberNames As IEnumerable(Of String)
Return Value
Type: IEnumerable<String>
[Missing <returns> documentation for "M:Rhino.Grasshopper.NodeInCodeTable.GetDynamicMemberNames"]
See Also
Reference
NodeInCodeTable Class
Rhino.Grasshopper Namespace