RhinoCommon SDK
LinearDimension Constructor
Initializes a new instance of the LinearDimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LinearDimension()
Public Sub New
See Also
Reference
LinearDimension Class
LinearDimension Overload
Rhino.Geometry.V6Annotation Namespace