RhinoCommon SDK
DisplayPipeline.PopCullFaceMode Method
 Pop a FaceCull flag off the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void PopCullFaceMode()
Public Sub PopCullFaceMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace