RhinoCommon SDK
AngularDimension.GetTextRectangle Method
[Missing <summary> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetTextRectangle(
	out Point3d[] corners
)
Public Function GetTextRectangle (
	<OutAttribute> ByRef corners As Point3d()
) As Boolean
Parameters
corners
Type: Rhino.Geometry.Point3d[]
[Missing <param name="corners"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace