RhinoCommon SDK
ObjectTable.AddV6LinearDimension Method (LinearDimension, ObjectAttributes)
 Adds a linear dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddV6LinearDimension(
	LinearDimension dimlinear,
	ObjectAttributes attributes
)
Public Function AddV6LinearDimension (
	dimlinear As LinearDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimlinear
Type: Rhino.Geometry.V6Annotation.LinearDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddV6LinearDimension(Rhino.Geometry.V6Annotation.LinearDimension,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddV6LinearDimension Overload
Rhino.DocObjects.Tables Namespace