RhinoCommon SDK
RhinoObject.GetRenderPrimitiveList Method
 Build custom render mesh(es) for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	bool preview
)
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	preview As Boolean
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build, if preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace