RhinoCommon SDK
ComponentFunctionInfo.Evaluate Method
 Evaluates the component with a particular set of arguments.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract Object[] Evaluate(
	IEnumerable args,
	bool keepTree,
	out string[] warnings
)
Public MustOverride Function Evaluate (
	args As IEnumerable,
	keepTree As Boolean,
	<OutAttribute> ByRef warnings As String()
) As Object()
Parameters
args
Type: System.Collections.IEnumerable
The arguments list.
keepTree
Type: System.Boolean
A value indicating whether tree should be considered valid inputs, and should be returned.
warnings
Type: System.String[]
Used to return a possible list of warnings.
Return Value
Type: Object[]
[Missing <returns> documentation for "M:Rhino.Grasshopper.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@)"]
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace