RhinoCommon SDK
AsyncRenderContext.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace