RhinoCommon SDK
ObjectTable.AddText Method (TextEntity, ObjectAttributes, DimensionStyle)
 Adds a text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddText(
	TextEntity text,
	ObjectAttributes attributes,
	DimensionStyle dimstyle
)
Public Function AddText (
	text As TextEntity,
	attributes As ObjectAttributes,
	dimstyle As DimensionStyle
) As Guid
Parameters
text
Type: Rhino.Geometry.V6Annotation.TextEntity
Text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.V6Annotation.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.V6Annotation.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: Guid
The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace