RhinoCommon SDK
Mesh.DestroyTree Method
 Destroys the mesh vertex access tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DestroyTree()
Public Sub DestroyTree
See Also
Reference
Mesh Class
Rhino.Geometry Namespace