RhinoCommon SDK
RdkViewModel.DocUndoHelper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.DocUndoHelper(System.String)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkViewModel.UndoHelper DocUndoHelper(
	string description
)
Public Function DocUndoHelper (
	description As String
) As RdkViewModel.UndoHelper
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.DocUndoHelper(System.String)"]
Return Value
Type: RdkViewModel.UndoHelper
[Missing <returns> documentation for "M:Rhino.UI.Controls.RdkViewModel.DocUndoHelper(System.String)"]
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace