RhinoCommon SDK
Mesh.ClearSurfaceData Method
 Removes surface parameters, curvature parameters and surface statistics from the mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearSurfaceData()
Public Sub ClearSurfaceData
See Also
Reference
Mesh Class
Rhino.Geometry Namespace