RhinoCommon SDK
ThumbnailListImpl.NewNativeWrapper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.NewNativeWrapper(System.IntPtr)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static IThumbnailList NewNativeWrapper(
	IntPtr cpp
)
Public Shared Function NewNativeWrapper (
	cpp As IntPtr
) As IThumbnailList
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.NewNativeWrapper(System.IntPtr)"]
Return Value
Type: IThumbnailList
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.NewNativeWrapper(System.IntPtr)"]
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace