RhinoCommon SDK
LinearWorkflow.CopyFrom Method
 Create a copy of linearworkflow
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.LinearWorkflow.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace