RhinoCommon SDK
Dimension Constructor (SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Dimension(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.Geometry.V6Annotation.Dimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.Geometry.V6Annotation.Dimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
See Also
Reference
Dimension Class
Dimension Overload
Rhino.Geometry.V6Annotation Namespace