RhinoCommon SDK
RealtimeDisplayMode Constructor
Initializes a new instance of the RealtimeDisplayMode class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected RealtimeDisplayMode()
Protected Sub New
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace