RhinoCommon SDK
AngularDimension.Create Method (Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static AngularDimension Create(
	Guid styleId,
	Plane plane,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Shared Function Create (
	styleId As Guid,
	plane As Plane,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
) As AngularDimension
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
extpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="extpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
extpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="extpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dirpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="dirpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dirpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="dirpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: AngularDimension
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
AngularDimension Class
Create Overload
Rhino.Geometry.V6Annotation Namespace