RhinoCommon SDK
DocumentOrFreeFloatingBase.EndChange Method
 See BeginChange
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool EndChange()
Public Function EndChange As Boolean
Return Value
Type: Boolean
true if the object has returned to no-changes mode.
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace