RhinoCommon SDK
RadialDimension Constructor
Initializes a new instance of the RadialDimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RadialDimension()
Public Sub New
See Also
Reference
RadialDimension Class
RadialDimension Overload
Rhino.Geometry.V6Annotation Namespace