RhinoCommon SDK
AnnotationText.Create Method
 Create RichText geometry or null if input is invalid
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static AnnotationText Create(
	string richTextString,
	Plane plane,
	DimensionStyle style,
	double rectWidth,
	double rotation
)
Public Shared Function Create (
	richTextString As String,
	plane As Plane,
	style As DimensionStyle,
	rectWidth As Double,
	rotation As Double
) As AnnotationText
Parameters
richTextString
Type: System.String
[Missing <param name="richTextString"/> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
rectWidth
Type: System.Double
[Missing <param name="rectWidth"/> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
rotation
Type: System.Double
[Missing <param name="rotation"/> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
Return Value
Type: AnnotationText
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)"]
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace