RhinoCommon SDK
InvalidDimensionStyleIdException Constructor
Initializes a new instance of the InvalidDimensionStyleIdException class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public InvalidDimensionStyleIdException(
	string msg
)
Public Sub New (
	msg As String
)
Parameters
msg
Type: System.String
[Missing <param name="msg"/> documentation for "M:Rhino.Geometry.V6Annotation.InvalidDimensionStyleIdException.#ctor(System.String)"]
See Also
Reference
InvalidDimensionStyleIdException Class
Rhino.Geometry.V6Annotation Namespace