RhinoCommon SDK
ObjectTable.AddRLeader Method (Leader, ObjectAttributes)
 Adds a Leader object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRLeader(
	Leader rleader,
	ObjectAttributes attributes
)
Public Function AddRLeader (
	rleader As Leader,
	attributes As ObjectAttributes
) As Guid
Parameters
rleader
Type: Rhino.Geometry.V6Annotation.Leader
The leader object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to rich text.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRLeader Overload
Rhino.DocObjects.Tables Namespace