RhinoCommon SDK
RealtimeDisplayMode.HudStatusText Method
 Override to display status of the render engine.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string HudStatusText()
Public Overridable Function HudStatusText As String
Return Value
Type: String
Status text to display
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace