RhinoCommon SDK
RdkViewModel.Discard Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.Discard(System.Guid)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Discard(
	Guid uuidDataType
)
Public Sub Discard (
	uuidDataType As Guid
)
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.Discard(System.Guid)"]
Implements
IRdkViewModel.Discard(Guid)
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace