RhinoCommon SDK
TextureEvaluator.Finalize Method
 For Dispose pattern
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace