RhinoCommon SDK
LinetypeTable.FindNameHash Method
Finds the linetype with a given name hash.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Linetype FindNameHash(
	NameHash hash
)
Public Function FindNameHash (
	hash As NameHash
) As Linetype
Parameters
hash
Type: Rhino.FileIO.NameHash
The name hash.
Return Value
Type: Linetype
 A linetype, or null if the name does not exist.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace