RhinoCommon SDK
ObjectTable.AddRLeader Method (Leader)
 Adds a Leader object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRLeader(
	Leader rleader
)
Public Function AddRLeader (
	rleader As Leader
) As Guid
Parameters
rleader
Type: Rhino.Geometry.V6Annotation.Leader
The leader object.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRLeader Overload
Rhino.DocObjects.Tables Namespace