RhinoCommon SDK
LinetypeTable.FindName Method
Finds the linetype with a given name.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Linetype FindName(
	string name
)
Public Function FindName (
	name As String
) As Linetype
Parameters
name
Type: System.String
The name.
Return Value
Type: Linetype
 A linetype, or null if the name does not exist.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace