RhinoCommon SDK
ViewCaptureSettings Constructor
Initializes a new instance of the ViewCaptureSettings class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewCaptureSettings()
Public Sub New
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace