RhinoCommon SDK
NurbsCurve.GrevillePoints Method
 Gets all Greville (Edit) points for this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3dList GrevillePoints()
Public Function GrevillePoints As Point3dList
Return Value
Type: Point3dList
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevillePoints"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace