RhinoCommon SDK
AsyncRenderContext.DeleteThis Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.DeleteThis"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void DeleteThis()
Protected Overridable Sub DeleteThis
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace