RhinoCommon SDK
ObjectTable.AddRichText Method (TextEntity, ObjectAttributes, HistoryRecord, Boolean)
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRichText(
	TextEntity richText,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddRichText (
	richText As TextEntity,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
richText
Type: Rhino.Geometry.V6Annotation.TextEntity
Rich text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to rich text.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRichText Overload
Rhino.DocObjects.Tables Namespace