RhinoCommon SDK
IPanelsService.GetPanel Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Object GetPanel(
	Guid panelId,
	uint documentSerialNumber
)
Function GetPanel (
	panelId As Guid,
	documentSerialNumber As UInteger
) As Object
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace