RhinoCommon SDK
LightArray Constructor
Initializes a new instance of the LightArray class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LightArray()
Public Sub New
See Also
Reference
LightArray Class
Rhino.Render Namespace