RhinoCommon SDK
LinearDimension.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static LinearDimension Create(
	Dimension.DimensionType dimtype,
	Guid styleId,
	Plane plane,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint,
	double rotationInPlane
)
Public Shared Function Create (
	dimtype As Dimension.DimensionType,
	styleId As Guid,
	plane As Plane,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d,
	rotationInPlane As Double
) As LinearDimension
Parameters
dimtype
Type: Rhino.Geometry.V6Annotation.Dimension.DimensionType
[Missing <param name="dimtype"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
defpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint1"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
defpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint2"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
rotationInPlane
Type: System.Double
[Missing <param name="rotationInPlane"/> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: LinearDimension
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.LinearDimension.Create(Rhino.Geometry.V6Annotation.Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace