RhinoCommon SDK
MeshNgonList.Clear Method
 Clears the Ngon list on the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace