RhinoCommon SDK
ChangeQueue.ProvideOriginalObject Method
[Missing <summary> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ProvideOriginalObject"]
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual bool ProvideOriginalObject()
Protected Overridable Function ProvideOriginalObject As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ProvideOriginalObject"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace