RhinoCommon SDK
Brep.Flip Method
 Reverses entire brep orientation of all faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Brep Class
Rhino.Geometry Namespace