RhinoCommon SDK
RadialDimension.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RadialDimension Create(
	Guid styleId,
	AnnotationType dimtype,
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint
)
Public Shared Function Create (
	styleId As Guid,
	dimtype As AnnotationType,
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d
) As RadialDimension
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimtype
Type: Rhino.Geometry.AnnotationType
[Missing <param name="dimtype"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
radiuspoint
Type: Rhino.Geometry.Point3d
[Missing <param name="radiuspoint"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: RadialDimension
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.Create(System.Guid,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace