RhinoCommon SDK
ObjectTable.Replace Method (Guid, AnnotationText)
Replaces one object with new text object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Replace(
	Guid objectId,
	AnnotationText text
)
Public Function Replace (
	objectId As Guid,
	text As AnnotationText
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
text
Type: Rhino.Geometry.AnnotationText
new text to be added. The text is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace