RhinoCommon SDK
LightManagerSupport.Dispose Method
Releases all resources used by the LightManagerSupport
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace