RhinoCommon SDK
Mesh.DestroyTopology Method
 Removes topology data, forcing all topology information to be recomputed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DestroyTopology()
Public Sub DestroyTopology
See Also
Reference
Mesh Class
Rhino.Geometry Namespace