RhinoCommon SDK
ViewCaptureWriter.DrawPoint Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected abstract void DrawPoint(
	PointStyle pointStyle,
	PointF center,
	Color fillColor,
	Color strokeColor,
	float diameterPoints,
	float innerDiameterPoints,
	float strokeWidthPoints,
	float rotationRadians
)
Protected MustOverride Sub DrawPoint (
	pointStyle As PointStyle,
	center As PointF,
	fillColor As Color,
	strokeColor As Color,
	diameterPoints As Single,
	innerDiameterPoints As Single,
	strokeWidthPoints As Single,
	rotationRadians As Single
)
Parameters
pointStyle
Type: Rhino.Display.PointStyle
[Missing <param name="pointStyle"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
center
Type: System.Drawing.PointF
[Missing <param name="center"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
diameterPoints
Type: System.Single
[Missing <param name="diameterPoints"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
innerDiameterPoints
Type: System.Single
[Missing <param name="innerDiameterPoints"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
strokeWidthPoints
Type: System.Single
[Missing <param name="strokeWidthPoints"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
rotationRadians
Type: System.Single
[Missing <param name="rotationRadians"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPoint(Rhino.Display.PointStyle,System.Drawing.PointF,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace