RhinoCommon SDK
AnnotationBase.ClearOverrideDimStyle Method
 Clear the override DimensionStyle for this annotation object, reverting to using the parent style for all properties
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ClearOverrideDimStyle()
Public Function ClearOverrideDimStyle As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.ClearOverrideDimStyle"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace