RhinoCommon SDK
RealtimeDisplayMode.GetRenderSize Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void GetRenderSize(
	out int width,
	out int height
)
Public Overridable Sub GetRenderSize (
	<OutAttribute> ByRef width As Integer,
	<OutAttribute> ByRef height As Integer
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace