RhinoCommon SDK
Leader.Create Method
 Creates a Leader geometry object
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Leader Create(
	string richText,
	Plane plane,
	DimensionStyle dimstyle,
	Point3d[] points
)
Public Shared Function Create (
	richText As String,
	plane As Plane,
	dimstyle As DimensionStyle,
	points As Point3d()
) As Leader
Parameters
richText
Type: System.String
[Missing <param name="richText"/> documentation for "M:Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])"]
points
Type: Rhino.Geometry.Point3d[]
[Missing <param name="points"/> documentation for "M:Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])"]
Return Value
Type: Leader
[Missing <returns> documentation for "M:Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])"]
See Also
Reference
Leader Class
Rhino.Geometry Namespace