RhinoCommon SDK
AnnotationBase Constructor
 Protected constructor for internal use.
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected AnnotationBase()
Protected Sub New
See Also
Reference
AnnotationBase Class
AnnotationBase Overload
Rhino.Geometry.V6Annotation Namespace