RhinoCommon SDK
FileSvg.Write Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileSvg.Write(Rhino.Display.ViewCaptureSettings,System.String)"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void Write(
	ViewCaptureSettings settings,
	string filename
)
Public Shared Sub Write (
	settings As ViewCaptureSettings,
	filename As String
)
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.FileIO.FileSvg.Write(Rhino.Display.ViewCaptureSettings,System.String)"]
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FileSvg.Write(Rhino.Display.ViewCaptureSettings,System.String)"]
Return Value
Type:
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace