RhinoCommon SDK
Plane.ToString Method
 Constructs the string representation of this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Text.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace