RhinoCommon SDK
LightArray.Dispose Method
Releases all resources used by the LightArray
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LightArray Class
Rhino.Render Namespace