RhinoCommon SDK
NurbsSurface.RemoveKnots Method
 Remove knots from parameter 0 or parameter 1 knot vector. Adjust the remaining control points to maintain surface position as closely as possible. The knots from Knots[index0] through Knots[index1 - 1] will be removed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RemoveKnots(
	int direction,
	int index0,
	int index1
)
Public Function RemoveKnots (
	direction As Integer,
	index0 As Integer,
	index1 As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 gets first parameter's domain, 1 gets second parameter's domain.
index0
Type: System.Int32
The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1
Type: System.Int32
The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Return Value
Type: Boolean
true if successful, false on failure.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace