RhinoCommon SDK
RhinoObject.GetSubObjects Method
 Gets an array of sub-objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject[] GetSubObjects()
Public Function GetSubObjects As RhinoObject()
Return Value
Type: RhinoObject[]
An array of subobjects, or null if there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace