RhinoCommon SDK
Sun.ShowDialog Method
Note: This API is now obsolete.
Show the tabbed sun dialog.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use Rhino.UI.Dialogs.ShowSunDialog(Sun sun) instead")]
public void ShowDialog()
<ObsoleteAttribute("Use Rhino.UI.Dialogs.ShowSunDialog(Sun sun) instead")>
Public Sub ShowDialog
See Also
Reference
Sun Class
Rhino.Render Namespace