RhinoCommon SDK
AsyncRenderContext.SupportsPause Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.SupportsPause"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool SupportsPause()
Public Overridable Function SupportsPause As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.AsyncRenderContext.SupportsPause"]
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace