RhinoCommon SDK
RhinoObject.UnhighlightAllSubObjects Method
 Removes highlighting from all subobjects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int UnhighlightAllSubObjects()
Public Function UnhighlightAllSubObjects As Integer
Return Value
Type: Int32
The number of changed subobjects.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace