RhinoCommon SDK
ObjectAttributes.Transform Method
 Apply a transformation.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
The transformation.
Return Value
Type: Boolean
trueif successful, false otherwise.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace