RhinoCommon SDK
Centermark.Create Method
 Create a new centermark
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Centermark Create(
	DimensionStyle dimensionStyle,
	Plane plane,
	Point3d centerpoint,
	double radius
)
Public Shared Function Create (
	dimensionStyle As DimensionStyle,
	plane As Plane,
	centerpoint As Point3d,
	radius As Double
) As Centermark
Parameters
dimensionStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimensionStyle"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Centermark
[Missing <returns> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
Centermark Class
Rhino.Geometry Namespace