RhinoCommon SDK
AnnotationObjectBase.AnnotationGeometry Method
[Missing <summary> documentation for "M:Rhino.V6DocObjects.AnnotationObjectBase.AnnotationGeometry(Rhino.DocObjects.RhinoObject)"]
Namespace: Rhino.V6DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static AnnotationBase AnnotationGeometry(
	RhinoObject aob
)
Public Shared Function AnnotationGeometry (
	aob As RhinoObject
) As AnnotationBase
Parameters
aob
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="aob"/> documentation for "M:Rhino.V6DocObjects.AnnotationObjectBase.AnnotationGeometry(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: AnnotationBase
[Missing <returns> documentation for "M:Rhino.V6DocObjects.AnnotationObjectBase.AnnotationGeometry(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
AnnotationObjectBase Class
Rhino.V6DocObjects Namespace