RhinoCommon SDK
ObjectTable.AddV6AngularDimension Method (AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds an angular dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddV6AngularDimension(
	AngularDimension dimangular,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddV6AngularDimension (
	dimangular As AngularDimension,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
dimangular
Type: Rhino.Geometry.V6Annotation.AngularDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddV6AngularDimension Overload
Rhino.DocObjects.Tables Namespace