RhinoCommon SDK
LightManagerSupport Constructor
Initializes a new instance of the LightManagerSupport class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LightManagerSupport(
	uint doc_uuid
)
Public Sub New (
	doc_uuid As UInteger
)
Parameters
doc_uuid
Type: System.UInt32
[Missing <param name="doc_uuid"/> documentation for "M:Rhino.Render.LightManagerSupport.#ctor(System.UInt32)"]
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace