RhinoCommon SDK
CommonComponentTable<T>.Clear Method
 Marks all items as deleted.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace