RhinoCommon SDK
Dimension.GetTextTransform Method
 Get the transform for this text object's text geometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform GetTextTransform(
	ViewportInfo viewport,
	DimensionStyle style,
	double textScale,
	bool drawForward
)
Public Function GetTextTransform (
	viewport As ViewportInfo,
	style As DimensionStyle,
	textScale As Double,
	drawForward As Boolean
) As Transform
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
textScale
Type: System.Double
[Missing <param name="textScale"/> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
drawForward
Type: System.Boolean
[Missing <param name="drawForward"/> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)"]
See Also
Reference
Dimension Class
Rhino.Geometry Namespace