RhinoCommon SDK
Centermark.AdjustFromPoints Method
 Update Dimension geometry from point locations
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6Annotation.Centermark.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d)"]
See Also
Reference
Centermark Class
Rhino.Geometry.V6Annotation Namespace