RhinoCommon SDK
AnnotationBase.ClearPropertyOverrides Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.ClearPropertyOverrides"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ClearPropertyOverrides()
Public Function ClearPropertyOverrides As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.ClearPropertyOverrides"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace