RhinoCommon SDK
TextureEvaluator.Dispose Method
 For Dispose pattern
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
TextureEvaluator Class
Dispose Overload
Rhino.Render Namespace