RhinoCommon SDK
AngularDimension Constructor
Initializes a new instance of the AngularDimension class
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AngularDimension()
Public Sub New
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry.V6Annotation Namespace