RhinoCommon SDK
ObjectTable.AddV6OrdinateDimension Method
 Adds an ordinate dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddV6OrdinateDimension(
	OrdinateDimension dimordinate,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddV6OrdinateDimension (
	dimordinate As OrdinateDimension,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
dimordinate
Type: Rhino.Geometry.V6Annotation.OrdinateDimension
Dimension object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
history
Type: Rhino.DocObjects.HistoryRecord
Object history to save.
reference
Type: System.Boolean
If reference, then object will not be saved into the 3dm file.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace