RhinoCommon SDK
UndoRecord.Dispose Method
 UndoRecord Dispose
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
UndoRecord Class
Dispose Overload
Rhino.UI.Controls Namespace