RhinoCommon SDK
Brep.Repair Method
 No support is available for this function.
Attempts to "right" a brep that is not faulty or incomplete.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Repair(
	double tol
)
Public Function Repair (
	tol As Double
) As Boolean
Parameters
tol
Type: System.Double
tolerance with which calculations are made.
Return Value
Type: Boolean
True on success.
See Also
Reference
Brep Class
Rhino.Geometry Namespace