RhinoCommon SDK
AsyncRenderContext.PauseRendering Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.PauseRendering"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void PauseRendering()
Public Overridable Sub PauseRendering
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace