RhinoCommon SDK
RealtimeDisplayMode.CaptureProgress Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.CaptureProgress"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual double CaptureProgress()
Public Overridable Function CaptureProgress As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.CaptureProgress"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace