RhinoCommon SDK
RealtimeDisplayMode.HudLastRenderedPass Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudLastRenderedPass"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual int HudLastRenderedPass()
Public Overridable Function HudLastRenderedPass As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudLastRenderedPass"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace