RhinoCommon SDK
RdkViewModel.NewNativeWrapper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewNativeWrapper(System.IntPtr)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static IRdkViewModel NewNativeWrapper(
	IntPtr cpp
)
Public Shared Function NewNativeWrapper (
	cpp As IntPtr
) As IRdkViewModel
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewNativeWrapper(System.IntPtr)"]
Return Value
Type: IRdkViewModel
[Missing <returns> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewNativeWrapper(System.IntPtr)"]
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace