RhinoCommon SDK
LightManagerSupportClient.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace