RhinoCommon SDK
ComponentFunctionInfo.ToString Method
 Returns a string represetning this function.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The namespace and the name.
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace