RhinoCommon SDK
RenderMaterial.CreateBasicMaterial Method
 Constructs a new basic material from a Material.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderMaterial CreateBasicMaterial(
	Material material
)
Public Shared Function CreateBasicMaterial (
	material As Material
) As RenderMaterial
Parameters
material
Type: Rhino.DocObjects.Material
(optional)The material to create the basic material from.
Return Value
Type: RenderMaterial
A new basic material.
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace