RhinoCommon SDK
ChangeQueue.CreateWorld Method
 Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void CreateWorld()
Public Sub CreateWorld
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace