RhinoCommon SDK
RdkViewModel.NewUndoHelper Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoHelper(System.String)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkViewModel.NewUndoRecord NewUndoHelper(
	string description
)
Public Function NewUndoHelper (
	description As String
) As RdkViewModel.NewUndoRecord
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoHelper(System.String)"]
Return Value
Type: RdkViewModel.NewUndoRecord
[Missing <returns> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoHelper(System.String)"]
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace