RhinoCommon SDK
RealtimeDisplayMode.SetGamma Method
 Set gamma for this RealtimeDisplayMode
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetGamma(
	float gamma
)
Public Sub SetGamma (
	gamma As Single
)
Parameters
gamma
Type: System.Single
[Missing <param name="gamma"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.SetGamma(System.Single)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace