RhinoCommon SDK
RealtimeDisplayMode.HudProductName Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudProductName"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string HudProductName()
Public Overridable Function HudProductName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudProductName"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace