RhinoCommon SDK
DimStyleTable.SetCurrent Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SetCurrent(
	int index,
	bool quiet
)
Public Function SetCurrent (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean)"]
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace