RhinoCommon SDK
RhinoObject.OnSelectionChanged Method
 Called when the selection state of this object has changed
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnSelectionChanged()
Protected Overridable Sub OnSelectionChanged
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace