RhinoCommon SDK
PreviewSceneServer.Dispose Method
 Dispose for PreviewSceneServer
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace