RhinoCommon SDK
RealtimeDisplayMode.HudMaximumPasses Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudMaximumPasses"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual int HudMaximumPasses()
Public Overridable Function HudMaximumPasses As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudMaximumPasses"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace