RhinoCommon SDK
ObjectTable.AddLinearDimension Method (LinearDimension)
 Adds a linear dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddLinearDimension(
	LinearDimension dimlinear
)
Public Function AddLinearDimension (
	dimlinear As LinearDimension
) As Guid
Parameters
dimlinear
Type: Rhino.Geometry.V6Annotation.LinearDimension
 Dimension object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddLinearDimension Overload
Rhino.DocObjects.Tables Namespace