RhinoCommon SDK
DisplayModeDescription Methods
The DisplayModeDescription type exposes the following members.
Methods
Name | Description
AddDisplayMode
DeleteDiplayMode
Dispose()
Dispose(Boolean)
ExportToFile
 Exports a DisplayModeDescription to a Windows-style .ini file.
Finalize |  (Overrides Object.Finalize().)
FindByName
GetDisplayMode
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
ImportFromFile
 Imports a DisplayModeDescription from a Windows-style .ini file.
UpdateDisplayMode
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace