RhinoCommon SDK
File3dmMaterialTable Methods
The File3dmMaterialTable type exposes the following members.
Methods
Name | Description
FindIndex
 Retrieves a material based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
Top
See Also
Reference
File3dmMaterialTable Class
Rhino.FileIO Namespace