RhinoCommon SDK
Centermark Methods
The Centermark type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
GetDisplayLines
Top
See Also
Reference
Centermark Class
Rhino.Geometry.V6Annotation Namespace