RhinoCommon SDK
ChangeQueue Methods
The ChangeQueue type exposes the following members.
Methods
Name | Description
ApplyClippingPlaneChanges
 Override this when you want to handle clippingplane changes
ApplyDynamicClippingPlaneChanges
 Override this when you want to handle dynamicclippingplane changes
ApplyDynamicLightChanges
 Handle dynamic light changes
ApplyDynamicObjectTransforms
 Handle dynamic object transforms
ApplyEnvironmentChanges
 Override this when you want to handle environment changes
ApplyGammaChanges
 Override this when you want to handle gamma changes
ApplyGroundPlaneChanges
 Override this when you want to handle groundplane changes
ApplyLightChanges
 Override this when you want to handle light changes
ApplyLinearWorkflowChanges
 Override this when you want to handle linear workflow changes
ApplyMaterialChanges
 Override when you want to handle material changes
ApplyMeshChanges
 Override this when you want to handle mesh changes.
ApplyMeshInstanceChanges
 Override this when you want to handle mesh instance changes (block instances and first-time added new meshes)
ApplyRenderSettingsChanges(DisplayRenderSettings)
 Override this when you want to handle render setting changes. These are for the viewport settings.
ApplyRenderSettingsChanges(RenderSettings)
 Override this when you need to handle background changes (through RenderSettings)
ApplySkylightChanges
 Override this when you want to handle skylight changes
ApplySunChanges
 Override this when you want to handle sun changes
ApplyViewChange
 Override ApplyViewChange when you want to receive changes to the view/camera
AreViewsEqual
 Compare to ViewInfo instances and decide whether they are equal or not. If you need to change the way the comparison is done you can override this function and implement your custom comparison.
BakeFor
 Override this if you need to control baking behavior for textures. By default bake everything.
BakingSize
 Override this if you need to control the size of the baked bitmaps for textures. By default the value returned is 2048.
ConvertCameraBasedLightToWorld
 Convert given (camera-based) light to a world-based light (in-place)
CrcFromGuid
 Helper function to get a CRC from a Guid.
CreateWorld
 Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
Dispose()
 Dispose our ChangeQueue
Dispose(Boolean)
 Dispose our ChangeQueue. Disposes unmanaged memory.
EnvironmentForid
 Get RenderEnvironment for given RenderHash
EnvironmentIdForUsage
 Get RenderEnvironment RenderHash for given usage.
Flush
 Tell the ChangeQueue to flush all collected events.
GetQueueGroundPlane
 Get groundplane known to the queue at the time of the Flush
GetQueueRenderSettings
 Get render settings known to the queue at the time of the Flush
GetQueueSceneBoundingBox
 Get the scene bounding box
GetQueueSkylight
 Get skylight known to the queue at the time of the Flush
GetQueueSun
 Get sun known to the queue at the time of the Flush
GetQueueView
 Get view known to the queue at the time of the Flush
MaterialFromId
 Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
NotifyBeginUpdates
 Override this when you want to be notified of begin of changes
NotifyDynamicUpdatesAreAvailable
 Override this when you want to be notified dynamic updates are available
NotifyEndUpdates
 Override this when you want to be notified when change notifications have ended.
OneShot
 Call Flush() once, after that automatically dispose the queue.
ProvideOriginalObject
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace