RhinoCommon SDK
Leader Methods
The Leader type exposes the following members.
Methods
Name | Description
Create
 Creates a Leader geometry object
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace