RhinoCommon SDK
Leader Methods
The Leader type exposes the following members.
Methods
Name | Description
Create
 Creates a Leader geometry object
Top
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace