RhinoCommon SDK
AnnotationObjectBase Methods
The AnnotationObjectBase type exposes the following members.
Methods
Name | Description
DimScale
 I really would like to change the name of this function to something more descriptive
GetArrowHeadCorners2d
 Get the corners of a polygon that contains the arrowhead
GetArrowHeadCorners3d
 Get the corners of a polygon that contains the arrowhead
GetTextXform
Top
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace