RhinoCommon SDK
FileSvg Methods
The FileSvg type exposes the following members.
Methods
Name | Description
Write
WriteImpl
 Write svg to a file
Top
See Also
Reference
FileSvg Class
Rhino.FileIO Namespace