RhinoCommon SDK
ComponentFunctionInfo Methods
The ComponentFunctionInfo type exposes the following members.
Methods
Name | Description
Evaluate
 Evaluates the component with a particular set of arguments.
EvaluateSilenceWarnings
 Infrastructure method that simplifies output and performs warning checks.
EvaluateTreeSilenceWarnings
 Infrastructure method that simplifies output and performs warning checks.
EvaluateTreeWithWarningsAsErrors
 Infrastructure method that simplifies output and performs warning checks.
EvaluateWithWarningsAsErrors
 Infrastructure method that simplifies output and performs warning checks.
SimplifyTreeOutput
 Performs list logical reduction when trees are not used.
ToString
 Returns a string represetning this function.
 (Overrides Object.ToString().)
Top
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace