RhinoCommon SDK
LightManagerSupport Methods
The LightManagerSupport type exposes the following members.
Methods
Name | Description
DeleteLight
GetLights
LightFromId
ModifyLight
PluginId
RegisterLightManager
RegisterProviders
RenderEngineId
Top
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace