RhinoCommon SDK
File3dmDimStyleTable Methods
The File3dmDimStyleTable type exposes the following members.
Methods
Name | Description
FindName
 Finds a DimensionStyle given its name.
FindNameHash
 Finds a DimensionStyle given its name hash.
Top
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace