RhinoCommon SDK
File3dmInstanceDefinitionTable Methods
The File3dmInstanceDefinitionTable type exposes the following members.
Methods
Name | Description
FindName
 Finds an InstanceDefinitionGeometry given its name.
FindNameHash
 Finds a InstanceDefinitionGeometry given its name hash.
Top
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace