RhinoCommon SDK
File3dmLinetypeTable Methods
The File3dmLinetypeTable type exposes the following members.
Methods
Name | Description
FindName
 Finds a Linetype given its name.
FindNameHash
 Finds a Linetype given its name hash.
Top
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace