RhinoCommon SDK
Dimension Methods
The Dimension type exposes the following members.
Methods
Name | Description
GetTextTransform
 Get the transform for this text object's text geometry
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace