RhinoCommon SDK
CustomGripObject Methods
The CustomGripObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean) |  (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
NewLocation
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace