RhinoCommon SDK
LinearDimension Methods
The LinearDimension type exposes the following members.
Methods
Name | Description
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace