RhinoCommon SDK
TextEntity Methods
The TextEntity type exposes the following members.
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
GetTextTransform
 Get the transform for this text object's text geometry
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace