RhinoCommon SDK
FontTable Methods
The FontTable type exposes the following members.
Methods
Name | Description
FindOrCreate(String, Boolean, Boolean)
FindOrCreate(String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
GetEnumerator
Top
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace