RhinoCommon SDK
AnnotationBase Methods
The AnnotationBase type exposes the following members.
Methods
Name | Description
ClearOverrideDimStyle
 Clear the override DimensionStyle for this annotation object, reverting to using the parent style for all properties
ClearPropertyOverrides
Explode
 Explodes this text entity into an array of curves.
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
IsPropertyOverridden
SetContext
 This function would not be called outside of Rhino but it is written this way not to couple this class with RhinoDoc. If you're thinking of calling this method from the Rhino context you should call the SetDefaultContext() extension method (AnnotationExtensions.cs)
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensinoStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
WrapText
 Wrap text
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace