RhinoCommon SDK
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace