RhinoCommon SDK
RenderMaterial Methods
The RenderMaterial type exposes the following members.
Methods
Name | Description
CreateBasicMaterial
 Constructs a new basic material from a Material.
GetTextureAmountFromUsage
GetTextureFromUsage
GetTextureOnFromUsage
SimulateMaterial(Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
TextureChildSlotName
 Override this function to provide information about which texture is used for the standard (ie - defined in ON_Texture) texture channels.
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace