RhinoCommon SDK
RenderPipeline Methods
The RenderPipeline type exposes the following members.
Methods
Name | Description
AddLightToScene
AddRenderMeshToScene
CloseWindow
 Closes the render window associated with this render instance.
CommandResult
ContinueModal
 Frequently called during a rendering by the frame work in order to determine if the rendering should continue.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetRenderWindow()
 Get the RenderWindow associated with this RenderPipeline instance.
GetRenderWindow(Boolean)
 As GetRenderWindow(), but if withWireframeChannel is true the returned RenderWindow will have the channel added.
IgnoreRhinoObject
NeedToProcessGeometryTable
NeedToProcessLightTable
OnRenderBegin
 Called by the framework when it is time to start rendering, the render window will be created at this point and it is safe to start
OnRenderBeginQuiet
 Called by the framework when it is time to start rendering quietly, there is no user interface when rendering in this mode and the default post process effects will get applied to the scene when the rendering is complete.
OnRenderEnd
 Called by the framework when the user closes the render window or clicks on the stop button in the render window.
OnRenderWindowBegin
Render
 Call this function to render the scene normally. The function returns when rendering is complete (or cancelled).
RenderEnterModalLoop
RenderExitModalLoop
RenderPreCreateWindow
RenderSceneWithNoMeshes
RenderSize
 Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
RenderWindow
 Call this function to render the scene in a view window. The function returns when rendering is complete (or cancelled).
SaveImage
 Saves the rendered image to a file. Does not prompt the user in any way.
SetAsyncRenderContext
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace