RhinoCommon SDK
CustomBrepObject Methods
The CustomBrepObject type exposes the following members.
Methods
Name | Description
Dispose()
 Releases unmanaged resources.
Dispose(Boolean) |  (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace