RhinoCommon SDK
MenuTask Methods
The MenuTask type exposes the following members.
Methods
Name | Description
Dispose
 MenuTask dispose
Finalize
 MenuTask destructor
 (Overrides Object.Finalize().)
IconIn
 Returns the associated in icon for the menutask item. Out icon is the icon displayed if the menu task is not selected and the in icon is represents that the menutask is selected. If the menutask does not contain two states then the IconIn will return the same icon as IconOut
IconOut
 Returns the associated out icon for the menutask item. Out icon is the icon displayed if the menu task is not selected.
Id
 Returns the Guid of the menutask
IsEnabled
 Returns true if the menutask item is enabled and false if the menutask item is disabled
IsForTopLevelContent
 Return true if the menutask is associated with the toplevel content and false if not
MenuOrder
 Return the order of the menutask
MenuSeparators
 Returns a value indicating if the menutask has menuseparators before, after or none
MenuString
 Returns the title of the menutask
Query
 Query if the task should be displayed to the user in a menu etc. The default implementation returns the result of calling origin.SupportsTask()
RenderEngineId
 Returns the render engine Guid of the menutask
SubMenu
 Returns the SubMenu value of the task
UserExecute
 Called to execute the function associated with the menutask
Top
See Also
Reference
MenuTask Class
Rhino.Render Namespace