RhinoCommon SDK
ICommonComponentTable<T> Methods
The ICommonComponentTable<T> generic type exposes the following members.
Methods
Name | Description
FindId
 Retrieves an object based on ID. You should prefer ID search over Index search.
FindIndex
 Retrieves an object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindNameHash
 Retrieves an object based on Name.
Top
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace