RhinoCommon SDK
CollapsibleSectionViewModel Methods
The CollapsibleSectionViewModel type exposes the following members.
Methods
Name | Description
Commit
Discard
GetData
 Call for an interface to data
Top
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace