RhinoCommon SDK
RenderTexture Methods
The RenderTexture type exposes the following members.
Methods
Name | Description
CreateEvaluator() |  Obsolete.
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
CreateEvaluator(RenderTexture.TextureEvaluatorFlags)
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
GetDisplayInViewport
GetEnvironmentMappingMode
GetEnvironmentMappingProjection
GetInternalEnvironmentMappingMode
GetMappingChannel
GetOffset
 Get offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
GetOffsetLocked
GetPreviewIn3D
GetPreviewLocalMapping
GetProjectionMode
GetRepeat
 Get repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
GetRepeatLocked
GetRotation
GetWcsBoxMapping
GetWrapType
IsHdrCapable
IsLinear
NewBitmapTexture
 Constructs a new basic texture from a SimulatedTexture.
PixelSize
 Get the texture dimensions for the RenderTexture.
SetDisplayInViewport(Boolean)
SetDisplayInViewport(Boolean, RenderContent.ChangeContexts)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
SetMappingChannel
SetOffset
 Set offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
SetOffsetLocked
SetPreviewIn3D
SetPreviewLocalMapping(Boolean)
SetPreviewLocalMapping(Boolean, RenderContent.ChangeContexts)
SetProjectionMode
SetRepeat
 Set repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
SetRepeatLocked
SetRotation
SetWrapType
SimulatedTexture
SimulateTexture(SimulatedTexture, Boolean) |  Obsolete.
SimulateTexture(SimulatedTexture, RenderTexture.TextureGeneration, Int32, RhinoObject)
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace