RhinoCommon SDK
FileReference Methods
The FileReference type exposes the following members.
Methods
Name | Description
Dispose
 Reclaims unmanaged resources used by this object.
Finalize
 (Overrides Object.Finalize().)
Top
See Also
Reference
FileReference Class
Rhino.FileIO Namespace