RhinoCommon SDK
DimStyleTable Methods
The DimStyleTable type exposes the following members.
Methods
Name | Description
Add(String)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
Delete(DimensionStyle)
 Removes an annotation style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find(Guid, Boolean)
Find(String, Boolean)
FindIndex
 Retrieves a DimensionStyle object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindRoot
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedStyleName()
 Get a unique name for a style that does not already exist in the DimStyle table
GetUnusedStyleName(String)
 Get a unique name for a dimension style that does not already exist in the DimStyle table
Modify(DimensionStyle, AnnotationBase)
Modify(DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
Modify(DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
SetCurrent
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace