RhinoCommon SDK
ViewCaptureSettings Methods
The ViewCaptureSettings type exposes the following members.
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace