RhinoCommon SDK
Rhino.Render Namespace
[Missing <summary> documentation for "N:Rhino.Render"]
Classes
Class | Description
AsyncRenderContext
 \ingroup rhino_render Inherit from AsyncRenderContext to be able to create asynchronous render engine implementations through RhinoCommon.
CachedTextureCoordinates
 Used for cached texture coordinates
City
 City
ContentUndoBlocker
ContentUndoHelper
 Content undo helper to be used with "using {}" to enclose a block of changes.
ConvertibleExtensions
 Extension methods for IConvertible that work when an object is a Variant.
CreatePreviewEventArgs
Used in RenderPlugIn virtual CreatePreview function
CreatePreviewEventArgs.SceneObject
CreateTexture2dPreviewEventArgs
CustomRenderContentAttribute
CustomRenderMeshProvider
 You must call CustomRenderMeshProvider.RegisterProviders() from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
Decal
 Represents a decal, or a picture that can be moved on an object.
DecalCreateParams
 Used by RhinoObject.AddDecal() to create and add a decal
Decals
Represents all the decals of an object.
Dithering
 This is the interface to linear workflow settings.
DocumentOrFreeFloatingBase
FreeFloatingBase
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
GroundPlane
 Represents an infinite plane for implementation by renderers. See SupportsFeature.
ImageFile
 Controls interaction with RDK render image files
ImageFileEventArgs
LightArray
LightManagerSupport
 Base class for implementing custom light managers in .NET
LightManagerSupportClient
LinearWorkflow
 This is the interface to linear workflow settings.
MappingTag
 Holds texture mapping information.
NamedValue
PixelBuffer
RdkUndoRecord
 RdkUndoRecord class
RealtimeDisplayMode
 Base class for implementing real-time display modes in .NET
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs
RealtimeDisplayMode.DrawMiddlegroundEventArgs
RealtimeDisplayMode.HudMaxPassesChangedEventArgs
RealtimeDisplayMode.InitFramebufferEventArgs
RealtimeDisplayModeClassInfo
 Class information obligatory for registering RealtimeDisplayMode implementations.
RenderContent
RenderContentChangedEventArgs
RenderContentCollection
RenderContentEventArgs
RenderContentFieldChangedEventArgs
RenderContentSerializer
 Used to import and export custom render content types such as materials, environments and textures. You must override RenderPlugIn.RenderContentSerializers() and return an array of derived RenderContentSerializer class types to add to the content browsers.
RenderContentType
 Represents one of the render content types registered with Rhino.
RenderEndEventArgs
 Contains information about why OnRenderEnd was called
RenderEnvironment
RenderEnvironmentTable
RenderMaterial
RenderMaterial.BasicMaterialParameterNames
 Parameter names for use in GetNamedParameter and SetNamedParameter with basic materials.
RenderMaterialTable
RenderPanels
 This class is used to extend the standard Render user interface
RenderPipeline
 Provides facilities to a render plug-in for integrating with the standard Rhino render window. Also adds helper functions for processing a render scene. This is the suggested class to use when integrating a renderer with Rhino and maintaining a "standard" user interface that users will expect.
RenderPlugInInfo
RenderPlugInList
RenderPrimitive
RenderPrimitiveList
RenderPropertyChangedEvent
 Used by Rhino.Render object property value has changed events.
RenderSettings
 Contains settings used in rendering.
RenderTabs
RenderTexture
RenderTextureTable
RenderWindow
RenderWindow.Channel
RenderWindow.ImageAdjust
 Class to set image adjusting settings to a RenderWindow. This can't be directly created. Instead, one should use RenderWindow.GetAdjust() to get an ImageAdjust instance that can be modified, then passed into RenderWindow.SetAdjust() to update image adjusting settings.1
RenderWindowClonedEventArgs
SimulatedEnvironment
SimulatedTexture
Skylight
Sun
 Represents the Sun on a little portion of Earth.
SupportOptions
TextureEvaluator
 This is the interface to a lightweight object capable of evaluating texture color throughout uvw space. Derive from this class to create your own texture evaluator to return from a custom RenderTexture.
TextureMapping
 Represents a texture mapping.
TimeZone
 TimeZone
TwoColorRenderTexture
Utilities
Interfaces
Interface | Description
ICurrentEnvironment
ICurrentEnvironment_Get
Enumerations
Enumeration | Description
CreatePreviewReason
 Reason the content preview is being generated
DecalMapping
DecalProjection
Dithering.Methods
 Dithering algorithm.
ImageFileEvent
LightMangerSupportCustomEvent
 LightMangerSupportCustomEvent
PreviewSceneQuality
Quality levels when creating preview images
RenderContent.ChangeContexts
 Context of a change to content parameters.
RenderContent.ExtraRequirementsSetContexts
RenderContent.MatchDataResult
 Return values for MatchData function
RenderContent.ShowContentChooserFlags
RenderContentChangeReason
 Enumeration denoting type of change for attach or detach
RenderContentKind
 Defines constant values for all render content kinds, such as material, environment or texture.
RenderContentStyles
RenderEnvironment.Usage
RenderMaterial.PreviewBackgroundType
 The default scene background for the image that appears in preview panes
RenderMaterial.PreviewGeometryType
 Geometry that appears in preview panes
RenderMaterial.StandardChildSlots
 Defines enumerated constant values for use in TextureChildSlotName(RenderMaterial.StandardChildSlots) method.
RenderPanelType
 Contains the custom user interfaces that may be provided
RenderPipeline.RenderReturnCode
RenderPrimitiveType
RenderSettings.FocalBlurModes
 Possible modes for focal blur
RenderTexture.TextureEvaluatorFlags
RenderTexture.TextureGeneration
RenderWindow.RenderSuccessCode
RenderWindow.StandardChannels
SimulatedEnvironment.BackgroundProjections
SimulatedTexture.EnvironmentMappingModes
SimulatedTexture.ProjectionModes
SupportOptions.RdkInitialLocation
SupportOptions.RdkTextureSize
TextureEnvironmentMappingMode
TextureGeneration
TextureMappingType
 Defines enumerated constants for mapping types such as planar, cylindrical or spherical.
TextureMode
TextureProjectionMode
TextureRenderHashFlags
TextureWrapType
Utilities.ShowContentChooserResults