RhinoCommon SDK
ObjectTable.AddRichText Method
Overload List
Name | Description
AddRichText(TextEntity)
 Adds a rich text object to the document.
AddRichText(TextEntity, ObjectAttributes)
 Adds a rich text object to the document.
AddRichText(TextEntity, ObjectAttributes, HistoryRecord, Boolean)
 Adds a rich text object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace