RhinoCommon SDK
RenderPipeline.GetRenderWindow Method
Overload List
Name | Description
GetRenderWindow()
 Get the RenderWindow associated with this RenderPipeline instance.
GetRenderWindow(Boolean)
 As GetRenderWindow(), but if withWireframeChannel is true the returned RenderWindow will have the channel added.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace