RhinoCommon SDK
AngularDimension Constructor
Overload List
Name | Description
AngularDimension()
Initializes a new instance of the AngularDimension class
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace