RhinoCommon SDK
LinearDimension Constructor
Overload List
Name | Description
LinearDimension()
Initializes a new instance of the LinearDimension class
LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace