RhinoCommon SDK
FontTable.FindOrCreate Method
Overload List
Name | Description
FindOrCreate(String, Boolean, Boolean)
FindOrCreate(String, Boolean, Boolean, DimensionStyle)
 Get a DimensionStyle with the specified characteristics
Top
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace