RhinoCommon SDK
ObjectTable.AddV6LinearDimension Method
Overload List
Name | Description
AddV6LinearDimension(LinearDimension)
 Adds a linear dimension object to the document.
AddV6LinearDimension(LinearDimension, ObjectAttributes)
 Adds a linear dimension object to the document.
AddV6LinearDimension(LinearDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds a linear dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace