RhinoCommon SDK
ObjectTable.AddV6AngularDimension Method
Overload List
Name | Description
AddV6AngularDimension(AngularDimension)
 Adds a angular dimension object to the document.
AddV6AngularDimension(AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the document.
AddV6AngularDimension(AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds an angular dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace