RhinoCommon SDK
ObjectTable.AddRLeader Method
Overload List
Name | Description
AddRLeader(Leader)
 Adds a Leader object to the document.
AddRLeader(Leader, ObjectAttributes)
 Adds a Leader object to the document.
AddRLeader(Leader, ObjectAttributes, HistoryRecord, Boolean)
 Adds a Leader object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace