RhinoCommon SDK
DisplayPipeline.FrameSize Property
 Gets the size of the framebuffer that this pipeline is drawing to.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Size FrameSize { get; }
Public ReadOnly Property FrameSize As Size
	Get
Property Value
Type: Size
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace