RhinoCommon SDK
Leader.LeaderTextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderTextHorizontalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace