RhinoCommon SDK
RenderContent.Parent Property
 Returns the top content in this parent/child chain.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContent Parent { get; }
Public ReadOnly Property Parent As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContent Class
Rhino.Render Namespace