RhinoCommon SDK
ComponentFunctionInfo.InputNames Property
 The function input parameter names.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<string> InputNames { get; }
Public ReadOnly Property InputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace