RhinoCommon SDK
AngularDimension.AngleRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.AngleRoundoff"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngleRoundoff { get; set; }
Public Property AngleRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace