RhinoCommon SDK
Texture.WrapV Property
 Texture wrapping mode in the V direction
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextureUvwWrapping WrapV { get; set; }
Public Property WrapV As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
See Also
Reference
Texture Class
Rhino.DocObjects Namespace