RhinoCommon SDK
AnnotationText.TextRotationDegrees Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.TextRotationDegrees"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationDegrees { get; set; }
Public Property TextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace