RhinoCommon SDK
Dimension.SuppressExtension1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.SuppressExtension1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SuppressExtension1 { get; set; }
Public Property SuppressExtension1 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace