RhinoCommon SDK
AnnotationText.VerticalAlignment Property
 Text vertical alignment
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.VerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As DimensionStyle.VerticalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.VerticalAlignment
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace