RhinoCommon SDK
Dimension.ExtensionLineOffset Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ExtensionLineOffset"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace