RhinoCommon SDK
AnnotationBase.DimensionScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.DimensionScale"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DimensionScale { get; set; }
Public Property DimensionScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace