RhinoCommon SDK
NurbsCurveKnotList.IsReadOnly Property
[Missing <summary> documentation for "P:Rhino.Geometry.Collections.NurbsCurveKnotList.IsReadOnly"]
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace