RhinoCommon SDK
OrdinateDimension.KinkPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.KinkPoint2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d KinkPoint2 { get; }
Public ReadOnly Property KinkPoint2 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace