RhinoCommon SDK
DimensionStyle.LeaderArrowSize Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowSize"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace