RhinoCommon SDK
RichTextObject.TextGeometry Property
 Get the text geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextEntity TextGeometry { get; }
Public ReadOnly Property TextGeometry As TextEntity
	Get
Property Value
Type: TextEntity
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace