RhinoCommon SDK
Leader.LeaderContentAngleStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Leader.LeaderContentAngleStyle"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ContentAngleStyle LeaderContentAngleStyle { get; set; }
Public Property LeaderContentAngleStyle As DimensionStyle.ContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.ContentAngleStyle
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace