RhinoCommon SDK
AnnotationBase.VerticalAlignment Property
 Text vertical alignment
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.VerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As DimensionStyle.VerticalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.VerticalAlignment
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace