RhinoCommon SDK
ProviderIds.Settings Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Settings"]
Namespace: Rhino.UI.Controls.DataSource
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Settings { get; }
Public Shared ReadOnly Property Settings As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace