RhinoCommon SDK
OrdinateDimension.KinkOffset2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.KinkOffset2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double KinkOffset2 { get; set; }
Public Property KinkOffset2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace