RhinoCommon SDK
ComponentFunctionInfo.InputsOptional Property
 Indications for each function input parameter whether it is optional.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<bool> InputsOptional { get; }
Public ReadOnly Property InputsOptional As IReadOnlyList(Of Boolean)
	Get
Property Value
Type: IReadOnlyList<Boolean>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace