RhinoCommon SDK
AnnotationBase.GetDimstyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.GetDimstyle"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Func<Guid, uint, DimensionStyle> GetDimstyle { get; }
Protected ReadOnly Property GetDimstyle As Func(Of Guid, UInteger, DimensionStyle)
	Get
Property Value
Type: Func<Guid, UInt32, DimensionStyle>
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace