RhinoCommon SDK
ComponentFunctionInfo.ComponentGuid Property
 The unique identifier of the Grasshopper component. It is the original developer's responsability to ensure that this ID is unique.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid ComponentGuid { get; }
Public ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace