RhinoCommon SDK
Dimension.SuppressExtension2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.SuppressExtension2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SuppressExtension2 { get; set; }
Public Property SuppressExtension2 As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace