RhinoCommon SDK
Dimension.FixedLengthExtensionOn Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.FixedLengthExtensionOn"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool FixedLengthExtensionOn { get; set; }
Public Property FixedLengthExtensionOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace