RhinoCommon SDK
AnnotationText.DimensionStyleId Property
 Get this text's dimstyle id
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DimensionStyleId { get; set; }
Public Property DimensionStyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace