RhinoCommon SDK
RadialDimension.RadiusPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.RadiusPoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d RadiusPoint { get; set; }
Public Property RadiusPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace