RhinoCommon SDK
Dimension.LengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.LengthRoundoff"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LengthRoundoff { get; set; }
Public Property LengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace