RhinoCommon SDK
OrdinateDimension.KinkOffset1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.KinkOffset1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double KinkOffset1 { get; set; }
Public Property KinkOffset1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace