RhinoCommon SDK
Leader.LeaderVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Leader.LeaderVerticalAlignment"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.VerticalAlignment LeaderVerticalAlignment { get; set; }
Public Property LeaderVerticalAlignment As DimensionStyle.VerticalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.VerticalAlignment
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace