RhinoCommon SDK
LinearDimension.ArrowPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.LinearDimension.ArrowPoint1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d ArrowPoint1 { get; }
Public ReadOnly Property ArrowPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace