RhinoCommon SDK
Dimension.AltLengthFactor Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltLengthFactor"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AltLengthFactor { get; set; }
Public Property AltLengthFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace