RhinoCommon SDK
Dimension.ArrowBlockId2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ArrowBlockId2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid ArrowBlockId2 { get; set; }
Public Property ArrowBlockId2 As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace