RhinoCommon SDK
Centermark.Type Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Centermark.Type"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationType Type { get; }
Public ReadOnly Property Type As AnnotationType
	Get
Property Value
Type: AnnotationType
See Also
Reference
Centermark Class
Rhino.Geometry.V6Annotation Namespace