RhinoCommon SDK
AnnotationText.TextHeight Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.TextHeight"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace