RhinoCommon SDK
AnnotationBase.HorizontalAlignment Property
 Text horizontal alignment
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace