RhinoCommon SDK
AngularDimension.AngleZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.AngleZeroSuppression"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ZeroSuppression AngleZeroSuppression { get; set; }
Public Property AngleZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace