RhinoCommon SDK
V6RadialDimensionObject.RadialDimensionGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RadialDimension RadialDimensionGeometry { get; }
Public ReadOnly Property RadialDimensionGeometry As RadialDimension
	Get
Property Value
Type: RadialDimension
See Also
Reference
V6RadialDimensionObject Class
Rhino.DocObjects Namespace