RhinoCommon SDK
TextEntity.TextRotationDegrees Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.TextEntity.TextRotationDegrees"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationDegrees { get; set; }
Public Property TextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TextEntity Class
Rhino.Geometry.V6Annotation Namespace