RhinoCommon SDK
AnnotationText.TextString Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.TextString"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string TextString { get; }
Public ReadOnly Property TextString As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace