RhinoCommon SDK
TextEntity.TextRotationRadians Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.TextEntity.TextRotationRadians"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationRadians { get; set; }
Public Property TextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TextEntity Class
Rhino.Geometry.V6Annotation Namespace