RhinoCommon SDK
Dimension.AltLengthResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltLengthResolution"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int AltLengthResolution { get; set; }
Public Property AltLengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace