RhinoCommon SDK
Dimension.TextRotation Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.TextRotation"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace