RhinoCommon SDK
AnnotationBase.RichText Property
 Text including additional RTF formatting information
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string RichText { get; }
Public ReadOnly Property RichText As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace