RhinoCommon SDK
DimensionStyle.DimRadialTextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextVerticalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment DimRadialTextVerticalAlignment { get; set; }
Public Property DimRadialTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace