RhinoCommon SDK
AnnotationBase.MaskOffset Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.MaskOffset"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MaskOffset { get; set; }
Public Property MaskOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace