RhinoCommon SDK
Leader.LeaderCurveStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderCurveStyle"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveStyle { get; set; }
Public Property LeaderCurveStyle As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
See Also
Reference
Leader Class
Rhino.Geometry Namespace