RhinoCommon SDK
Dimension.LengthResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.LengthResolution"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int LengthResolution { get; set; }
Public Property LengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace