RhinoCommon SDK
AnnotationBase.TextHeight Property
Text height
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace