RhinoCommon SDK
AnnotationBase.MaskColor Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.MaskColor"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color MaskColor { get; set; }
Public Property MaskColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace