RhinoCommon SDK
Dimension.DistanceScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.DistanceScale"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DistanceScale { get; set; }
Public Property DistanceScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace