RhinoCommon SDK
Texture.MappingChannelId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Texture.MappingChannelId"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MappingChannelId { get; }
Public ReadOnly Property MappingChannelId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Texture Class
Rhino.DocObjects Namespace