RhinoCommon SDK
AnnotationBase.Text Property
Note: This API is now obsolete.
 Text including additional RTF formatting information
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use RichText or PlainText")]
public string Text { get; }
<ObsoleteAttribute("Use RichText or PlainText")>
Public ReadOnly Property Text As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace