RhinoCommon SDK
ComponentFunctionInfo.DelegateNoWarnings Property
 Returns a delegate that can be directly invoked using a list of arguments. This flattens trees.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Delegate DelegateNoWarnings { get; }
Public ReadOnly Property DelegateNoWarnings As Delegate
	Get
Property Value
Type: Delegate
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace