RhinoCommon SDK
Leader.LeaderHasLanding Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderHasLanding"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool LeaderHasLanding { get; set; }
Public Property LeaderHasLanding As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Leader Class
Rhino.Geometry Namespace