RhinoCommon SDK
RevSurface.Axis Property
 Gets the axis of revolution.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line Axis { get; }
Public ReadOnly Property Axis As Line
	Get
Property Value
Type: Line
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace