RhinoCommon SDK
RenderContent.Hidden Property
 Determines if the content has the hidden flag set.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderContent Class
Rhino.Render Namespace