RhinoCommon SDK
Dimension.AltZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltZeroSuppression"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ZeroSuppression AltZeroSuppression { get; set; }
Public Property AltZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace