RhinoCommon SDK
DimensionStyle.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Index"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace