RhinoCommon SDK
Dimension.DetailMeasured Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.DetailMeasured"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DetailMeasured { get; set; }
Public Property DetailMeasured As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace