RhinoCommon SDK
LinearDimension.ExtensionLine2End Property
 Gets the end of the second extension line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d ExtensionLine2End { get; }
Public ReadOnly Property ExtensionLine2End As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace