RhinoCommon SDK
ComponentFunctionInfo.Name Property
 The function name.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace