RhinoCommon SDK
RenderContent.FirstChild Property
 Return First child of this content or nullptr if none.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContent FirstChild { get; }
Public ReadOnly Property FirstChild As RenderContent
	Get
Property Value
Type: RenderContent
See Also
Reference
RenderContent Class
Rhino.Render Namespace