RhinoCommon SDK
DimensionStyle.Id Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Id"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace