RhinoCommon SDK
ComponentFunctionInfo.OutputTypeNames Property
 Grasshopper returns several items in general. This property retuns the output type names.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<string> OutputTypeNames { get; }
Public ReadOnly Property OutputTypeNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace