RhinoCommon SDK
Dimension.ToleranceHeightScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ToleranceHeightScale"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ToleranceHeightScale { get; set; }
Public Property ToleranceHeightScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace