RhinoCommon SDK
Dimension.AltSuffix Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltSuffix"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string AltSuffix { get; set; }
Public Property AltSuffix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace