RhinoCommon SDK
Light.AttenuationVector Property
 Gets or Sets the attenuation vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d AttenuationVector { get; set; }
Public Property AttenuationVector As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace