RhinoCommon SDK
DimensionStyle.IsDeleted Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.IsDeleted"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsDeleted { get; }
Public ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace