RhinoCommon SDK
Dimension.FixedExtensionLength Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.FixedExtensionLength"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FixedExtensionLength { get; set; }
Public Property FixedExtensionLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace