RhinoCommon SDK
RenderMaterial.DefaultPreviewSize Property
 The default preview geometry size
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DefaultPreviewSize { get; set; }
Public Property DefaultPreviewSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace