RhinoCommon SDK
OrdinateDimension.DefPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.DefPoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DefPoint { get; set; }
Public Property DefPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace