RhinoCommon SDK
Dimension.DimensionTextPlacement Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.DimensionTextPlacement"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextDisplayAlignment DimensionTextPlacement { get; set; }
Public Property DimensionTextPlacement As TextDisplayAlignment
	Get
	Set
Property Value
Type: TextDisplayAlignment
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace