RhinoCommon SDK
V6OrdinateDimensionObject.OrdinateDimensionGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public OrdinateDimension OrdinateDimensionGeometry { get; }
Public ReadOnly Property OrdinateDimensionGeometry As OrdinateDimension
	Get
Property Value
Type: OrdinateDimension
See Also
Reference
V6OrdinateDimensionObject Class
Rhino.DocObjects Namespace