RhinoCommon SDK
AnnotationBase.DimensionStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.DimensionStyle"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace