RhinoCommon SDK
Dimension.AltUnitsDisplay Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltUnitsDisplay"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AltUnitsDisplay { get; set; }
Public Property AltUnitsDisplay As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace