RhinoCommon SDK
Dimension.ToleranceLowerValue Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ToleranceLowerValue"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ToleranceLowerValue { get; set; }
Public Property ToleranceLowerValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace