RhinoCommon SDK
ComponentFunctionInfo.FullScriptingName Property
 Shows the full name of the component, including optional periods. Removes spaces and common operator signs.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FullScriptingName { get; }
Public ReadOnly Property FullScriptingName As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace