RhinoCommon SDK
ObjectAttributes.Decals Property
 Gets all object decals associated with this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Decals Decals { get; }
Public ReadOnly Property Decals As Decals
	Get
Property Value
Type: Decals
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace