RhinoCommon SDK
ComponentFunctionInfo.DelegateTree Property
 Returns a delegate that can be directly invoked using a list of arguments. This considers trees and simplifies single-output components.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Delegate DelegateTree { get; }
Public ReadOnly Property DelegateTree As Delegate
	Get
Property Value
Type: Delegate
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace