RhinoCommon SDK
Leader.Points2D Property
 Get or set the 2d points defining the curve used by this leader
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d[] Points2D { get; set; }
Public Property Points2D As Point2d()
	Get
	Set
Property Value
Type: Point2d[]
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace