RhinoCommon SDK
ObjectAttributes.GroupCount Property
number of groups object belongs to.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace