RhinoCommon SDK
AnnotationText.TextIsWrapped Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.TextIsWrapped"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TextIsWrapped { get; set; }
Public Property TextIsWrapped As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace