RhinoCommon SDK
LinearWorkflow.PostProcessFrameBuffer Property
 Linear workflow active state
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool PostProcessFrameBuffer { get; set; }
Public Property PostProcessFrameBuffer As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace