RhinoCommon SDK
AnnotationBase.TextIsWrapped Property
 Is text wrapping on
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TextIsWrapped { get; set; }
Public Property TextIsWrapped As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace