RhinoCommon SDK
Leader.LeaderTextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderTextVerticalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment LeaderTextVerticalAlignment { get; set; }
Public Property LeaderTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace