RhinoCommon SDK
Texture.UvwTransform Property
 Transform to be applied to each instance of this texture if ApplyUvw is true
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
Texture Class
Rhino.DocObjects Namespace