RhinoCommon SDK
Dimension.AltPrefix Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltPrefix"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string AltPrefix { get; set; }
Public Property AltPrefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace