RhinoCommon SDK
Dimension.LengthFactor Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.LengthFactor"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LengthFactor { get; set; }
Public Property LengthFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace