RhinoCommon SDK
TextEntity.TextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.TextEntity.TextHorizontalAlignment"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
TextEntity Class
Rhino.Geometry.V6Annotation Namespace