RhinoCommon SDK
AnnotationText.TextRotationRadians Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.TextRotationRadians"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationRadians { get; set; }
Public Property TextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace