RhinoCommon SDK
RadialDimension.LeaderArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.LeaderArrowSize"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace