RhinoCommon SDK
DimensionStyle.IsReference Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.IsReference"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace