RhinoCommon SDK
RenderContent.Fields Property
 Rhino.Render.Fields FieldDictionary which provides access to setting and retrieving field values.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FieldDictionary Fields { get; }
Public ReadOnly Property Fields As FieldDictionary
	Get
Property Value
Type: FieldDictionary
See Also
Reference
RenderContent Class
Rhino.Render Namespace