RhinoCommon SDK
AnnotationBase.DimensionStyleId Property
 Id of this annotation's prent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DimensionStyleId { get; set; }
Public Property DimensionStyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace