RhinoCommon SDK
AngularDimension.AngleResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.AngleResolution"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int AngleResolution { get; set; }
Public Property AngleResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace