RhinoCommon SDK
V6LinearDimensionObject.LinearDimensionGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LinearDimension LinearDimensionGeometry { get; }
Public ReadOnly Property LinearDimensionGeometry As LinearDimension
	Get
Property Value
Type: LinearDimension
See Also
Reference
V6LinearDimensionObject Class
Rhino.DocObjects Namespace