RhinoCommon SDK
AngularDimension.AngleFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.AngleFormat"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.AngleDisplayFormat AngleFormat { get; set; }
Public Property AngleFormat As DimensionStyle.AngleDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.AngleDisplayFormat
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace