RhinoCommon SDK
ContentHash.Sha1ContentHash Property
 Gets the 20-bytes long SHA1 hash of the content.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<byte> Sha1ContentHash { get; }
Public ReadOnly Property Sha1ContentHash As IReadOnlyList(Of Byte)
	Get
Property Value
Type: IReadOnlyList<Byte>
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace