RhinoCommon SDK
AnnotationBase.MaskColorSource Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.MaskColorSource"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.MaskType MaskColorSource { get; set; }
Public Property MaskColorSource As DimensionStyle.MaskType
	Get
	Set
Property Value
Type: DimensionStyle.MaskType
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace