RhinoCommon SDK
Leader.LeaderVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderVerticalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment LeaderVerticalAlignment { get; set; }
Public Property LeaderVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace