RhinoCommon SDK
AnnotationBase.DrawTextMask Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.DrawTextMask"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DrawTextMask { get; set; }
Public Property DrawTextMask As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace