RhinoCommon SDK
ComponentFunctionInfo.OutputNames Property
 Grasshopper returns several items in general. This property retuns the output names.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<string> OutputNames { get; }
Public ReadOnly Property OutputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace