RhinoCommon SDK
AnnotationText.Plane Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationText.Plane"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace