RhinoCommon SDK
ConstructionPlane.ShowZAxis Property
 Gets or sets whether the Z axis of the grid shuld be visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowZAxis { get; set; }
Public Property ShowZAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace