RhinoCommon SDK
LinearWorkflow.PostProcessGammaReciprocal Property
 Linear workflow gamma
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float PostProcessGammaReciprocal { get; }
Public ReadOnly Property PostProcessGammaReciprocal As Single
	Get
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace