RhinoCommon SDK
DisplayPipeline.SupportsShading Property
 Gets whether or not this pipeline supports shaded meshes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SupportsShading { get; }
Public ReadOnly Property SupportsShading As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace