RhinoCommon SDK
ConstructionPlane.Name Property
 Gets or sets the name of the grid.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace