RhinoCommon SDK
AnnotationBase.ParentDimensionStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.ParentDimensionStyle"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle ParentDimensionStyle { get; set; }
Public Property ParentDimensionStyle As DimensionStyle
	Get
	Set
Property Value
Type: DimensionStyle
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace