RhinoCommon SDK
Light.Intensity Property
 Gets or sets the light intensity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Intensity { get; set; }
Public Property Intensity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace