RhinoCommon SDK
Texture.TextureType Property
 Controls how the pixels in the bitmap are interpreted
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextureType TextureType { get; set; }
Public Property TextureType As TextureType
	Get
	Set
Property Value
Type: TextureType
See Also
Reference
Texture Class
Rhino.DocObjects Namespace