RhinoCommon SDK
DimensionStyle.TextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextVerticalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.VerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As DimensionStyle.VerticalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.VerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace