RhinoCommon SDK
ComponentFunctionInfo.OutputDescriptions Property
 Grasshopper returns several items in general. This property retuns the output descriptions.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<string> OutputDescriptions { get; }
Public ReadOnly Property OutputDescriptions As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace