RhinoCommon SDK
Light.PowerCandela Property
 Gets or sets the light power in candelas (cd).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PowerCandela { get; set; }
Public Property PowerCandela As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace