RhinoCommon SDK
Components.NodeInCodeFunctions Property
 Returns a collection with all component functions.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static NodeInCodeTable NodeInCodeFunctions { get; }
Public Shared ReadOnly Property NodeInCodeFunctions As NodeInCodeTable
	Get
Property Value
Type: NodeInCodeTable
See Also
Reference
Components Class
Rhino.Grasshopper Namespace