RhinoCommon SDK
RenderContent.Document Property
 Get the document this content belongs to or null if the content has not yet been added to a document. This will be null when content is generated for browsers or preview generation.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace