RhinoCommon SDK
Leader.ContentType Property
 Type of annotation on the leader Currently only text
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderContentType ContentType { get; }
Public ReadOnly Property ContentType As DimensionStyle.LeaderContentType
	Get
Property Value
Type: DimensionStyle.LeaderContentType
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace