RhinoCommon SDK
Dimension.Measurement Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.Measurement"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Measurement { get; }
Public ReadOnly Property Measurement As Double
	Get
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry Namespace