RhinoCommon SDK
DimensionStyle.TextAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextDisplayAlignment TextAlignment { get; set; }
Public Property TextAlignment As TextDisplayAlignment
	Get
	Set
Property Value
Type: TextDisplayAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace