RhinoCommon SDK
Arrowhead.BlockId Property
 Id of block used for user-defined arrowhead
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid BlockId { get; }
Public ReadOnly Property BlockId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Arrowhead Class
Rhino.Geometry.V6Annotation Namespace