RhinoCommon SDK
ConstructionPlane.Plane Property
 Gets or sets the geometric plane to use for construction.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace