RhinoCommon SDK
MeshInstance.ReceiveShadows Property
 Return true if mesh instance should receive shadows
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ReceiveShadows { get; }
Public ReadOnly Property ReceiveShadows As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace