RhinoCommon SDK
Leader.LeaderHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderHorizontalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextHorizontalAlignment LeaderHorizontalAlignment { get; set; }
Public Property LeaderHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
Leader Class
Rhino.Geometry Namespace