RhinoCommon SDK
LinearDimension.DefPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.LinearDimension.DefPoint2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DefPoint2 { get; set; }
Public Property DefPoint2 As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace