RhinoCommon SDK
DisplayConduit.Enabled Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayConduit.Enabled"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace