RhinoCommon SDK
RenderContent.Name Property
 Instance name for this content.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace