RhinoCommon SDK
AnnotationText.PlainText Property
 Returns unformatted string
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string PlainText { get; }
Public ReadOnly Property PlainText As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace