RhinoCommon SDK
RadialDimension.KneePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.KneePoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d KneePoint { get; }
Public ReadOnly Property KneePoint As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace