RhinoCommon SDK
ComponentFunctionInfo.FullName Property
 Returns the name of the component prefixed by, if existing, the namespace.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FullName { get; }
Public ReadOnly Property FullName As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace