RhinoCommon SDK
AnnotationBase.Font Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.Font"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace