RhinoCommon SDK
Dimension.Prefix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.Prefix"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry Namespace