RhinoCommon SDK
ContentHash.Sha1NameHash Property
 Gets the 20-bytes long SHA1 hash of the name.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<byte> Sha1NameHash { get; }
Public ReadOnly Property Sha1NameHash As IReadOnlyList(Of Byte)
	Get
Property Value
Type: IReadOnlyList<Byte>
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace