RhinoCommon SDK
Dimension.AlternateBelowLine Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AlternateBelowLine"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AlternateBelowLine { get; set; }
Public Property AlternateBelowLine As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace