RhinoCommon SDK
Dimension.ArrowheadType2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ArrowheadType2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ArrowType ArrowheadType2 { get; set; }
Public Property ArrowheadType2 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace