RhinoCommon SDK
Dimension.ToleranceUpperValue Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ToleranceUpperValue"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ToleranceUpperValue { get; set; }
Public Property ToleranceUpperValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace