RhinoCommon SDK
LinearDimension.DimlinePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.LinearDimension.DimlinePoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DimlinePoint { get; set; }
Public Property DimlinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace