RhinoCommon SDK
Leader.LeaderArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderArrowSize"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Leader Class
Rhino.Geometry Namespace