RhinoCommon SDK
DimensionStyle.LengthFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LengthFormat"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LengthDisplayFormat LengthFormat { get; set; }
Public Property LengthFormat As DimensionStyle.LengthDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplayFormat
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace