RhinoCommon SDK
ComponentFunctionInfo.Namespace Property
 The function namespace.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Namespace { get; }
Public ReadOnly Property Namespace As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace