RhinoCommon SDK
AnnotationBase.DrawForward Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.DrawForward"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DrawForward { get; set; }
Public Property DrawForward As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace