RhinoCommon SDK
NameHash.Sha1Hash Property
 Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped unicode (UTF-32) code points.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<byte> Sha1Hash { get; }
Public ReadOnly Property Sha1Hash As IReadOnlyList(Of Byte)
	Get
Property Value
Type: IReadOnlyList<Byte>
See Also
Reference
NameHash Class
Rhino.FileIO Namespace