RhinoCommon SDK
RenderContent.TypeDescription Property
 Description for your content type. ie. "Procedural checker pattern"
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract string TypeDescription { get; }
Public MustOverride ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace