RhinoCommon SDK
Texture.WrapU Property
 Texture wrapping mode in the U direction
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextureUvwWrapping WrapU { get; set; }
Public Property WrapU As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
See Also
Reference
Texture Class
Rhino.DocObjects Namespace