RhinoCommon SDK
Dimension.ToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ToleranceResolution"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ToleranceResolution { get; set; }
Public Property ToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace