RhinoCommon SDK
MeshingParameters.RefineAngle Property
 Gets or sets the mesh parameter refine angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double RefineAngle { get; set; }
Public Property RefineAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace