RhinoCommon SDK
Dimension.AltLengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.AltLengthRoundoff"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AltLengthRoundoff { get; set; }
Public Property AltLengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace