RhinoCommon SDK
AnnotationBase.TextRotationDegrees Property
 Rotation of text in degrees
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationDegrees { get; set; }
Public Property TextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace