RhinoCommon SDK
LinearDimension.Arrowhead1End Property
 Gets the arrow head end of the first extension line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d Arrowhead1End { get; }
Public ReadOnly Property Arrowhead1End As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace