RhinoCommon SDK
Light.Direction Property
 Gets or sets the vector direction of the camera.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d Direction { get; set; }
Public Property Direction As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace