RhinoCommon SDK
AngularDimension.ArrowPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.ArrowPoint2"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d ArrowPoint2 { get; }
Public ReadOnly Property ArrowPoint2 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace