RhinoCommon SDK
Dimension.ZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ZeroSuppression"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ZeroSuppression ZeroSuppression { get; set; }
Public Property ZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace