RhinoCommon SDK
ViewCaptureSettings.Size Property
 Total size of the image or page in dots
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Size Size { get; }
Public ReadOnly Property Size As Size
	Get
Property Value
Type: Size
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace