RhinoCommon SDK
ComponentFunctionInfo.Description Property
 The function description.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace