RhinoCommon SDK
AnnotationBase.PlainText Property
 Text stripped of RTF formatting information
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string PlainText { get; }
Public ReadOnly Property PlainText As String
	Get
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace