RhinoCommon SDK
RenderContent.DocumentAssoc Property
 If this content is associated by a document in any way, the document will be returned. This includes copies of contents that were initially in the document. Otherwise null.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc DocumentAssoc { get; }
Public ReadOnly Property DocumentAssoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace