RhinoCommon SDK
Dimension.BaselineSpacing Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.BaselineSpacing"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace