RhinoCommon SDK
Dimension.ExtensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ExtensionLineExtension"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ExtensionLineExtension { get; set; }
Public Property ExtensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace