RhinoCommon SDK
AnnotationBase.TextRotationRadians Property
 Rotation of text in radians
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotationRadians { get; set; }
Public Property TextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace