RhinoCommon SDK
AnnotationBase.HasPropertyOverrides Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.HasPropertyOverrides"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasPropertyOverrides { get; }
Public ReadOnly Property HasPropertyOverrides As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace