RhinoCommon SDK
RadialDimension.LeaderArrowBlockId Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.LeaderArrowBlockId"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace