RhinoCommon SDK
Leader.LeaderLandingLength Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Leader.LeaderLandingLength"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LeaderLandingLength { get; set; }
Public Property LeaderLandingLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace