RhinoCommon SDK
Leader.LeaderContentAngleStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderContentAngleStyle"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderContentAngleStyle LeaderContentAngleStyle { get; set; }
Public Property LeaderContentAngleStyle As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
Leader Class
Rhino.Geometry Namespace