RhinoCommon SDK
AnnotationText.HorizontalAlignment Property
 Text horizontal alignment
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace