RhinoCommon SDK
AnnotationText.FormatWidth Property
 Text format width (Wrapping rectangle)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FormatWidth { get; set; }
Public Property FormatWidth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace