RhinoCommon SDK
Light.PowerWatts Property
 Gets or sets the light power in watts (W).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PowerWatts { get; set; }
Public Property PowerWatts As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace