RhinoCommon SDK
Dimension.UseDefaultTextPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.UseDefaultTextPoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool UseDefaultTextPoint { get; set; }
Public Property UseDefaultTextPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace