RhinoCommon SDK
ConstructionPlane.ShowAxes Property
 Gets or sets whether the axes of the grid shuld be visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowAxes { get; set; }
Public Property ShowAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace