RhinoCommon SDK
RhinoView.Maximized Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.Maximized"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Maximized { get; set; }
Public Property Maximized As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace