RhinoCommon SDK
V6CentermarkObject.CentermarkGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Centermark CentermarkGeometry { get; }
Public ReadOnly Property CentermarkGeometry As Centermark
	Get
Property Value
Type: Centermark
See Also
Reference
V6CentermarkObject Class
Rhino.DocObjects Namespace