RhinoCommon SDK
DimensionStyle.DimTextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextVerticalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment DimTextVerticalAlignment { get; set; }
Public Property DimTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace