RhinoCommon SDK
OrdinateDimension.KinkPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.KinkPoint1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d KinkPoint1 { get; }
Public ReadOnly Property KinkPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace