RhinoCommon SDK
AnnotationBase.GetModelUnits Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AnnotationBase.GetModelUnits"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Func<uint, UnitSystem> GetModelUnits { get; set; }
Public Property GetModelUnits As Func(Of UInteger, UnitSystem)
	Get
	Set
Property Value
Type: Func<UInt32, UnitSystem>
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace