RhinoCommon SDK
Dimension.CentermarkStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.CentermarkStyle"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.CenterMarkStyle CentermarkStyle { get; set; }
Public Property CentermarkStyle As DimensionStyle.CenterMarkStyle
	Get
	Set
Property Value
Type: DimensionStyle.CenterMarkStyle
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace