RhinoCommon SDK
RadialDimension.LeaderArrowType Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.LeaderArrowType"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace