RhinoCommon SDK
TextEntity.TextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.TextEntity.TextVerticalAlignment"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
TextEntity Class
Rhino.Geometry.V6Annotation Namespace