RhinoCommon SDK
RadialDimension.LeaderCurveStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.RadialDimension.LeaderCurveStyle"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveStyle { get; set; }
Public Property LeaderCurveStyle As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace