RhinoCommon SDK
OrdinateDimension.LeaderPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.OrdinateDimension.LeaderPoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d LeaderPoint { get; set; }
Public Property LeaderPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
OrdinateDimension Class
Rhino.Geometry.V6Annotation Namespace