RhinoCommon SDK
Light.Specular Property
 Gets or sets the specular color.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color Specular { get; set; }
Public Property Specular As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Light Class
Rhino.Geometry Namespace