RhinoCommon SDK
Leader.LeaderArrowBlockId Property
[Missing <summary> documentation for "P:Rhino.Geometry.Leader.LeaderArrowBlockId"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Leader Class
Rhino.Geometry Namespace