RhinoCommon SDK
Dimension.ArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ArrowSize"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ArrowSize { get; set; }
Public Property ArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace