RhinoCommon SDK
RLeaderObject.LeaderGeometry Property
 Get the leader geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Leader LeaderGeometry { get; }
Public ReadOnly Property LeaderGeometry As Leader
	Get
Property Value
Type: Leader
See Also
Reference
RLeaderObject Class
Rhino.DocObjects Namespace