RhinoCommon SDK
RevSurface.Curve Property
 Gets the revolute curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace