RhinoCommon SDK
Dimension.CentermarkSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.CentermarkSize"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double CentermarkSize { get; set; }
Public Property CentermarkSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace