RhinoCommon SDK
AngularDimension.CenterPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.CenterPoint"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d CenterPoint { get; set; }
Public Property CenterPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace