RhinoCommon SDK
Leader.LeaderHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Leader.LeaderHorizontalAlignment"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment LeaderHorizontalAlignment { get; set; }
Public Property LeaderHorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace