RhinoCommon SDK
Dimension.DimensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.DimensionLineExtension"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DimensionLineExtension { get; set; }
Public Property DimensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace