RhinoCommon SDK
Arrowhead.ArrowType Property
 Type of arrowhead used by annotation
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ArrowType ArrowType { get; }
Public ReadOnly Property ArrowType As DimensionStyle.ArrowType
	Get
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Arrowhead Class
Rhino.Geometry.V6Annotation Namespace