RhinoCommon SDK
Dimension.TextFormula Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.TextFormula"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string TextFormula { get; set; }
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace