RhinoCommon SDK
BoundingBox.Area Property
 Gets the area of this BoundingBox.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace