RhinoCommon SDK
DimensionStyle.LeaderVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderVerticalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.VerticalAlignment LeaderVerticalAlignment { get; set; }
Public Property LeaderVerticalAlignment As DimensionStyle.VerticalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.VerticalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace