RhinoCommon SDK
Dimension.ToleranceFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ToleranceFormat"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ToleranceDisplayFormat ToleranceFormat { get; set; }
Public Property ToleranceFormat As DimensionStyle.ToleranceDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.ToleranceDisplayFormat
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace