RhinoCommon SDK
DimensionStyle.LeaderContentAngleType Property
 Style of leader content angle Horizontal Aligned Rotated HorizontalToScreen
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderContentAngleStyle LeaderContentAngleType { get; set; }
Public Property LeaderContentAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace