RhinoCommon SDK
Dimension.ArrowheadType1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.Dimension.ArrowheadType1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ArrowType ArrowheadType1 { get; set; }
Public Property ArrowheadType1 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace