RhinoCommon SDK
AngularDimension.DefPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Annotation.AngularDimension.DefPoint1"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DefPoint1 { get; set; }
Public Property DefPoint1 As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace