RhinoCommon SDK
ComponentFunctionInfo.InputTypeNames Property
 The function input type names.
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IReadOnlyList<string> InputTypeNames { get; }
Public ReadOnly Property InputTypeNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
See Also
Reference
ComponentFunctionInfo Class
Rhino.Grasshopper Namespace