RhinoCommon SDK
RadialDimension Properties
The RadialDimension type exposes the following members.
Properties
Name | Description
CenterPoint
DimlinePoint
KneePoint
RadiusPoint
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry.V6Annotation Namespace