RhinoCommon SDK
Dimension Properties
The Dimension type exposes the following members.
Properties
Name | Description
DetailMeasured
DistanceScale
Measurement
TextFormula
TextRotation
UseDefaultTextPoint
Top
See Also
Reference
Dimension Class
Rhino.Geometry.V6Annotation Namespace