RhinoCommon SDK
RadialDimension Properties
The RadialDimension type exposes the following members.
Properties
Name | Description
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderContentAngleStyle
LeaderCurveStyle
RadiusPoint
Type
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace