RhinoCommon SDK
LightManagerSupport Properties
The LightManagerSupport type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace