RhinoCommon SDK
Leader Properties
The Leader type exposes the following members.
Properties
Name | Description
ContentType
 Type of annotation on the leader Currently only text
Curve
 Gets the curve used by this leader
LeaderArrowSize
LeaderArrowType
LeaderContentAngleStyle
LeaderCurveStyle
LeaderHorizontalAlignment
LeaderVerticalAlignment
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
Top
See Also
Reference
Leader Class
Rhino.Geometry.V6Annotation Namespace