RhinoCommon SDK
OrdinateDimension Properties
The OrdinateDimension type exposes the following members.
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Type
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace