RhinoCommon SDK
AnnotationText Properties
The AnnotationText type exposes the following members.
Properties
Name | Description
DimensionStyleId
 Get this text's dimstyle id
FormatWidth
 Text format width (Wrapping rectangle)
Height
 Text height
HorizontalAlignment
 Text horizontal alignment
PlainText
 Returns unformatted string
Plane
TextHeight
TextIsWrapped
TextRotationDegrees
TextRotationRadians
TextString
VerticalAlignment
 Text vertical alignment
Top
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace