RhinoCommon SDK
RealtimeDisplayModeClassInfo Properties
The RealtimeDisplayModeClassInfo type exposes the following members.
Properties
Name | Description
GUID
 Get the RealtimeDisplayMode implementation GUID
Name
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
RealtimeDisplayModeType
 Get the type being registered.
Top
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace