RhinoCommon SDK
ICollapsibleSection Properties
The ICollapsibleSection type exposes the following members.
Properties
Name | Description
BackgroundColor
Collapsible
CommandOptionName
Height
Hidden
Id
InitiallyExpanded
PlugInId
SettingsTag
ViewModel
Top
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace