RhinoCommon SDK
AnnotationBase Properties
The AnnotationBase type exposes the following members.
Properties
Name | Description
DimensionScale
DimensionStyle
DimensionStyleId
 Id of this annotation's prent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
DrawForward
Font
FormatWidth
 Text format width (Wrapping rectangle)
GetDimstyle
GetModelUnits
HasPropertyOverrides
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskColorSource
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskOffset
 Offset for the border around text of the rectangle used to draw the mask. This value multiplied by TextHeight is the offset on each side of the tight rectangle around the text characters to the mask rectangle. The default value is 0.1.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
ParentDimensionStyle
PlainText
 Text stripped of RTF formatting information
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextFormula |  Obsolete.
TextHeight
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
TextIsWrapped
 Is text wrapping on
TextRotationDegrees
 Rotation of text in degrees
TextRotationRadians
 Rotation of text in radians
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace