RhinoCommon SDK
AnnotationBase Properties
The AnnotationBase type exposes the following members.
Properties
Name | Description
DimensionStyleId
Id of dimension style in the dimension style table that this annotation uses
FormatWidth
 Text format width (Wrapping rectangle)
HorizontalAlignment
 Text horizontal alignment
PlainText
 Text stripped of RTF formatting information
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextHeight
Text height
TextIsWrapped
 Is text wrapping on
VerticalAlignment
 Text vertical alignment
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry.V6Annotation Namespace