RhinoCommon SDK
ViewCaptureSettings Properties
The ViewCaptureSettings type exposes the following members.
Properties
Name | Description
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DrawAxis
DrawBackground
DrawGrid
DrawLockedObjects
IsValid
Resolution
 Capture "density" in dots per inch
Size
 Total size of the image or page in dots
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace