RhinoCommon SDK
AngularDimension Properties
The AngularDimension type exposes the following members.
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
Type
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry.V6Annotation Namespace