RhinoCommon SDK
File3dmObjectTable Properties
The File3dmObjectTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns ModelGeometry.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Gets the number of File3dmObjects in this table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace