RhinoCommon SDK
LinearDimension Properties
The LinearDimension type exposes the following members.
Properties
Name | Description
ArrowPoint1
ArrowPoint2
DefPoint1
DefPoint2
DimlinePoint
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry.V6Annotation Namespace