RhinoCommon SDK
AnnotationText Class
[Missing <summary> documentation for "T:Rhino.Geometry.AnnotationText"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationText
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AnnotationText : GeometryBase
<SerializableAttribute>
Public Class AnnotationText
	Inherits GeometryBase
The AnnotationText type exposes the following members.
Constructors
Name | Description
AnnotationText
 Protected constructor for internal use.
Top
Properties
Name | Description
DimensionStyleId
 Get this text's dimstyle id
FormatWidth
 Text format width (Wrapping rectangle)
Height
 Text height
HorizontalAlignment
 Text horizontal alignment
PlainText
 Returns unformatted string
Plane
TextHeight
TextIsWrapped
TextRotationDegrees
TextRotationRadians
TextString
VerticalAlignment
 Text vertical alignment
Top
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
GetTextTransform
 Get the transform for this text object's text geometry
SetTextString
WrapText
Top
See Also
Reference
Rhino.Geometry Namespace