RhinoCommon SDK
AngularDimension Class
 Represents an angular dimension. ON_V6_DimAngular
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.AngularDimension
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AngularDimension : Dimension
<SerializableAttribute>
Public Class AngularDimension
	Inherits Dimension
The AngularDimension type exposes the following members.
Constructors
Name | Description
AngularDimension()
Initializes a new instance of the AngularDimension class
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
Type
Top
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace