RhinoCommon SDK
RdkBreadCrumbViewModel Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.RdkBreadCrumbViewModel"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.RdkViewModel
 Rhino.UI.Controls.RdkBreadCrumbViewModel
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RdkBreadCrumbViewModel : RdkViewModel
Public Class RdkBreadCrumbViewModel
	Inherits RdkViewModel
The RdkBreadCrumbViewModel type exposes the following members.
Constructors
Name | Description
RdkBreadCrumbViewModel
Initializes a new instance of the RdkBreadCrumbViewModel class
Top
Properties
Name | Description
CEC
Collection
NmbOfSelected
RenderContentCollectionSelectionReader
RenderContentCollectionSelectionWriter
RenderContentLookupReader
RenderContentLookupWriter
Selected
Type
Top
Methods
Name | Description
DisplayData
SelectThumbData
SetSelected
ThumbDataElementViewModelPropertyChanged
Top
Events
Name | Description
PropertyChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace