RhinoCommon SDK
HatchPatternTable Class
 All of the hatch pattern definitions contained in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<HatchPattern>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<HatchPattern>
 Rhino.DocObjects.Tables.HatchPatternTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class HatchPatternTable : RhinoDocCommonTable<HatchPattern>,
	ICollection<HatchPattern>, IEnumerable<HatchPattern>, IEnumerable
Public NotInheritable Class HatchPatternTable
	Inherits RhinoDocCommonTable(Of HatchPattern)
	Implements ICollection(Of HatchPattern), IEnumerable(Of HatchPattern),
	IEnumerable
The HatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of patterns in the table.
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Document
Document that owns this table.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Delete(HatchPattern) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(HatchPattern, Boolean)
Find |  Obsolete.
 Finds the hatch pattern with a given name. Search ignores case.
FindName
 Finds the hatch pattern with a given name. Search ignores case.
FindNameHash
 Finds a HatchPattern given its name hash.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace