RhinoCommon SDK
RadialDimension Class
 Represents a radial dimension. ON_V6_DimRadial
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.RadialDimension
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class RadialDimension : Dimension
<SerializableAttribute>
Public Class RadialDimension
	Inherits Dimension
The RadialDimension type exposes the following members.
Constructors
Name | Description
RadialDimension()
Initializes a new instance of the RadialDimension class
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
CenterPoint
DimlinePoint
KneePoint
RadiusPoint
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace