RhinoCommon SDK
Dialogs Class
[Missing <summary> documentation for "T:Rhino.UI.Dialogs"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Dialogs
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static class Dialogs
Public NotInheritable Class Dialogs
The Dialogs type exposes the following members.
Methods
Name | Description
KillSplash
 Destroy the splash screen if it is being displayed.
SetCustomColorDialog
ShowAboutDialog
ShowCheckListBox
 Displays Rhino's check list box.
ShowColorDialog(Color)
 Display Rhino's color selection dialog.
ShowColorDialog(Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Color, Boolean, String)
 Display Rhino's color selection dialog.
ShowColorDialog(Object, Color4f, Boolean)
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(IWin32Window, Color4f, Boolean) |  Obsolete.
 Displays the standard modal color picker dialog for floating point colors.
ShowColorDialog(Object, Color4f, Boolean, Dialogs.OnColorChangedEvent)
 Displays the standard modal color picker dialog for floating point colors.
ShowComboListBox
 Displays Rhino's combo list box.
ShowContextMenu
ShowEditBox
Display dialog prompting the user to enter a string.
ShowListBox(String, String, IList)
ShowListBox(String, String, IList, Object)
ShowMessage(String, String)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(String, String, ShowMessageButton, ShowMessageIcon)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(Object, String, String, ShowMessageButton, ShowMessageIcon, ShowMessageDefaultButton, ShowMessageOptions, ShowMessageMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String, MessageBoxButtons, MessageBoxIcon) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMultiListBox
ShowNumberBox(String, String, Double)
ShowNumberBox(String, String, Double, Double, Double)
ShowPropertyListBox
ShowSelectLayerDialog
 Displays Rhino's single layer selection dialog.
ShowSelectMultipleLayersDialog
ShowSemiModal |  Obsolete.
 Show a windows form that is modal in the sense that this function does not return until the form is closed, but also allows for interaction with other elements of the Rhino user interface.
ShowSunDialog
Show the tabbed sun dialog.
ShowTextDialog
 Display a text dialog similar to the dialog used for the "What" command.
Top
See Also
Reference
Rhino.UI Namespace