RhinoCommon SDK
DimensionStyle.LeaderCurveStyle Enumeration
 Type of leader curve
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderCurveStyle
Public Enumeration LeaderCurveStyle
Members
Member name | Value | Description
None | 0
Polyline | 1
Spline | 2
See Also
Reference
Rhino.DocObjects Namespace