RhinoCommon SDK
DimensionStyle.LeaderContentType Enumeration
 Type of leader content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderContentType
Public Enumeration LeaderContentType
Members
Member name | Value | Description
None | 0
Text | 1
TextDot | 2
Block | 3
See Also
Reference
Rhino.DocObjects Namespace