RhinoCommon SDK
RdkThumbnaillistViewModel Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.RdkThumbnaillistViewModel"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.RdkViewModel
 Rhino.UI.Controls.RdkThumbnaillistViewModel
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RdkThumbnaillistViewModel : RdkViewModel
Public Class RdkThumbnaillistViewModel
	Inherits RdkViewModel
The RdkThumbnaillistViewModel type exposes the following members.
Constructors
Name | Description
RdkThumbnaillistViewModel
Initializes a new instance of the RdkThumbnaillistViewModel class
Top
Properties
Name | Description
CEC
Collection
Kind
RenderContentCollectionReader
RenderContentCollectionSelectionReader
RenderContentCollectionSelectionWriter
RenderContentCollectionWriter
RenderContentLookupReader
RenderContentLookupWriter
Selected
Type
Top
Methods
Name | Description
DisplayData
SelectThumbData
SetSelected
ThumbDataElementViewModelPropertyChanged
Top
Events
Name | Description
PropertyChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace