RhinoCommon SDK
BlendContinuity Enumeration
 Used in curve and surface blending functions
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum BlendContinuity
Public Enumeration BlendContinuity
Members
Member name | Value | Description
Position | 0
Tangency | 1
Curvature | 2
See Also
Reference
Rhino.Geometry Namespace