RhinoCommon SDK
FreeFloatingBase Class
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class FreeFloatingBase
Public MustInherit Class FreeFloatingBase
The FreeFloatingBase type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace