RhinoCommon SDK
FileSvg Class
 Support for SVG file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileSvg
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class FileSvg
Public MustInherit Class FileSvg
The FileSvg type exposes the following members.
Constructors
Name | Description
FileSvg
Initializes a new instance of the FileSvg class
Top
Methods
Name | Description
Write
WriteImpl
 Write svg to a file
Top
See Also
Reference
Rhino.FileIO Namespace