RhinoCommon SDK
Leader Class
 Leader geometry class
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class Leader : AnnotationBase
<SerializableAttribute>
Public Class Leader
	Inherits AnnotationBase
The Leader type exposes the following members.
Constructors
Name | Description
Leader
 Constructor
Top
Properties
Name | Description
ContentType
 Type of annotation on the leader Currently only text
Curve
 Gets the curve used by this leader
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderContentAngleStyle
LeaderCurveStyle
LeaderHasLanding
LeaderHorizontalAlignment
LeaderLandingLength
LeaderVerticalAlignment
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
Top
Methods
Name | Description
Create
 Creates a Leader geometry object
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace