RhinoCommon SDK
LayerTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTable"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Layer>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<Layer>
 Rhino.DocObjects.Tables.LayerTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class LayerTable : RhinoDocCommonTable<Layer>,
	ICollection<Layer>, IEnumerable<Layer>, IEnumerable
Public NotInheritable Class LayerTable
	Inherits RhinoDocCommonTable(Of Layer)
	Implements ICollection(Of Layer), IEnumerable(Of Layer),
	IEnumerable
The LayerTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of layers in the layer table, excluding deleted layers.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of layers in the layer table, including deleted layers.
 (Overrides CommonComponentTable<T>.Count.)
CurrentLayer
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Returns reference to the current layer. Note that this reference may become invalid after a call to AddLayer().
CurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Resturns: Zero based layer table index of the current layer.
Document
Document that owns this table.
Item
 Conceptually, the layer table is an array of layers. The operator[] can be used to get individual layers. A layer is either active or deleted and this state is reported by Layer.IsDeleted.
Top
Methods
Name | Description
Add()
 Adds a new layer with default definition to the layer table.
Add(Layer)
 Adds a new layer with specified definition to the layer table.
Add(String, Color)
 Adds a new layer with specified definition to the layer table.
AddReferenceLayer()
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
AddReferenceLayer(Layer)
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Delete(Layer)
Deletes layer.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Guid, Boolean)
Deletes layer.
Delete(Int32, Boolean)
Deletes layer.
Delete(Layer, Boolean)
Deletes layer.
Find(Guid, Boolean) |  Obsolete.
Finds a layer with a matching ID.
Find(String, Boolean) |  Obsolete.
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
Find(Guid, Boolean, Int32)
Finds a layer with a matching ID.
Find(Guid, String, Boolean) |  Obsolete.
Finds a layer with a given name and matching parent ID.
Find(Guid, String, Int32)
Finds a layer with a given name and matching parent ID.
FindByFullPath(String, Boolean) |  Obsolete.
FindByFullPath(String, Int32)
 Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
FindName
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
FindNameHash
 Finds a Layer given its name hash.
FindNext(Int32, String)
FindNext(Int32, String, Boolean) |  Obsolete.
ForceLayerVisible(Guid)
 Makes a layer and all of its parent layers visible.
ForceLayerVisible(Int32)
 Makes a layer and all of its parent layers visible.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetSelected
 Returns the indices of layers that are selected on the Layer user interface.
GetUnusedLayerName()
 Gets the next unused layer name used as default when creating new layers.
GetUnusedLayerName(Boolean) |  Obsolete.
 Gets the next unused layer name used as default when creating new layers.
Modify(Layer, Guid, Boolean)
Modifies layer settings.
Modify(Layer, Int32, Boolean)
Modifies layer settings.
Purge(Guid, Boolean)
 Deletes a layer and all geometry objects on a layer.
Purge(Int32, Boolean)
 Deletes a layer and all geometry objects on a layer
Select
 Selects layers in the Layer user interface.
SetCurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Undelete
 Undeletes a layer that has been deleted by DeleteLayer().
UndoModify(Guid)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Int32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Guid, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace