RhinoCommon SDK
RdkViewModel Class
 ViewModel wraps IRhinoUiController
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.RdkViewModel
 Rhino.UI.Controls.RdkBreadCrumbViewModel
 Rhino.UI.Controls.RdkThumbnaillistViewModel
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RdkViewModel : IRdkViewModel,
	IHasCppImplementation, IDisposable
Public MustInherit Class RdkViewModel
	Implements IRdkViewModel, IHasCppImplementation, IDisposable
The RdkViewModel type exposes the following members.
Constructors
Name | Description
RdkViewModel
Initializes a new instance of the RdkViewModel class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Commit
Discard
Dispose
Releases all resources used by the RdkViewModel
DocUndoHelper
Find
GetData
NewNativeWrapper
NewUndoHelper
Top
Events
Name | Description
DataChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace