RhinoCommon SDK
TextVerticalAlignment Enumeration
 Vertical location of text attach point relative to text
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextVerticalAlignment
Public Enumeration TextVerticalAlignment
Members
Member name | Value | Description
Top | 0
MiddleOfTop | 1
BottomOfTop | 2
Middle | 3
MiddleOfBottom | 4
Bottom | 5
BottomOfBoundingBox | 6
See Also
Reference
Rhino.DocObjects Namespace