RhinoCommon SDK
Skylight Class
[Missing <summary> documentation for "T:Rhino.Render.Skylight"]
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Skylight
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class Skylight : DocumentOrFreeFloatingBase
Public NotInheritable Class Skylight
	Inherits DocumentOrFreeFloatingBase
The Skylight type exposes the following members.
Properties
Name | Description
CustomEnvironment
CustomEnvironmentOn
Enabled
ShadowIntensity
Top
Methods
Name | Description
Top
Events
Name | Description
Changed
 This event is raised when a Skylight property value is changed.
Top
See Also
Reference
Rhino.Render Namespace