RhinoCommon SDK
LightManagerSupport Class
[Missing <summary> documentation for "T:Rhino.Render.LightManagerSupport"]
Inheritance Hierarchy
System.Object
 Rhino.Render.LightManagerSupport
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class LightManagerSupport
Public MustInherit Class LightManagerSupport
The LightManagerSupport type exposes the following members.
Constructors
Name | Description
LightManagerSupport
 Default constructor
Top
Methods
Name | Description
DeleteLight
GetLights
LightFromId
ModifyLight
PluginId
RegisterLightManager
RegisterProviders
RenderEngineId
Top
See Also
Reference
Rhino.Render Namespace