RhinoCommon SDK
CustomRenderMeshProvider Class
 You must call CustomRenderMeshProvider.RegisterProviders() from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshProvider
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class CustomRenderMeshProvider
Public MustInherit Class CustomRenderMeshProvider
The CustomRenderMeshProvider type exposes the following members.
Constructors
Name | Description
CustomRenderMeshProvider
 Default constructor
Top
Properties
Name | Description
CurvePipingId
DisplacementId
EdgeSofteningId
Name
 The name of the provider for UI display.
ShutLiningId
ThickeningId
Top
Methods
Name | Description
AllObjectsChanged() |  Obsolete.
 Call this method if your render meshes change.
AllObjectsChanged(RhinoDoc)
 Call this method if your render meshes change.
BoundingBox
 Returns a bounding box for the custom render meshes for the given object.
BuildCustomMeshes
 Build custom render mesh(es).
DocumentBasedMeshesChanged
ObjectChanged
RegisterProviders
 Call this method once from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
WillBuildCustomMeshes
 Determines if custom render meshes will be built for a particular object.
Top
See Also
Reference
Rhino.Render Namespace