RhinoCommon SDK
GroundPlane Class
 Represents an infinite plane for implementation by renderers. See SupportsFeature.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.GroundPlane
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class GroundPlane : DocumentOrFreeFloatingBase
Public Class GroundPlane
	Inherits DocumentOrFreeFloatingBase
The GroundPlane type exposes the following members.
Properties
Name | Description
Altitude
 Height above world XY plane in model units.
AutoAltitude
 Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.
Enabled
 Determines whether the document ground plane is enabled.
MaterialInstanceId
 Id of material in material table for this ground plane.
ShadowOnly
 Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
ShowUnderside
 If this is off, the ground plane will not be visible when seen from below.
TextureOffset
 Texture mapping offset in world units.
TextureRotation
 Texture mapping rotation around world origin + offset in degrees.
TextureSize
 Texture mapping single UV span size in world units.
Top
Methods
Name | Description
Top
Events
Name | Description
Changed
 This event is raised when a GroundPlane property value is changed.
Top
See Also
Reference
Rhino.Render Namespace