RhinoCommon SDK
Dimension Class
 Represents a base class for dimensions ON_V6_Dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.AngularDimension
 Rhino.Geometry.V6Annotation.Centermark
 Rhino.Geometry.V6Annotation.LinearDimension
 Rhino.Geometry.V6Annotation.OrdinateDimension
 Rhino.Geometry.V6Annotation.RadialDimension
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public abstract class Dimension : AnnotationBase
<SerializableAttribute>
Public MustInherit Class Dimension
	Inherits AnnotationBase
The Dimension type exposes the following members.
Constructors
Name | Description
Dimension()
Initializes a new instance of the Dimension class
Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Top
Properties
Name | Description
DetailMeasured
DistanceScale
Measurement
TextFormula
TextRotation
UseDefaultTextPoint
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace