RhinoCommon SDK
TextureWrapType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureWrapType"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureWrapType
Public Enumeration TextureWrapType
Members
Member name | Value | Description
Clamped | 0
Repeating | 1
See Also
Reference
Rhino.Render Namespace