RhinoCommon SDK
DimensionStyle.HorizontalAlignment Enumeration
 Attachment of content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum HorizontalAlignment
Public Enumeration HorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Left aligned
Center | 1 |  Centered
Right | 2 |  Right aligned
Auto | 3 |  Determined by orientation Primarily for leaders to make text right align when tail is to the left and left align when tail is to the right
See Also
Reference
Rhino.DocObjects Namespace