RhinoCommon SDK
PreviewSceneQuality Enumeration
Quality levels when creating preview images
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PreviewSceneQuality
Public Enumeration PreviewSceneQuality
Members
Member name | Value | Description
RealtimeQuick | -1 | Very fast preview. Typically using the internal OpenGL preview generator.
RefineFirstPass | 1 | Low quality rendering for quick preview.
RefineSecondPass | 2 | Medium quality rendering for intermediate preview.
RefineThirdPass | 3 | Full quality rendering (quality comes from user settings)
See Also
Reference
Rhino.Render Namespace