RhinoCommon SDK
DimStyleTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTable"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<DimensionStyle>
 Rhino.DocObjects.Tables.RhinoDocCommonTable<DimensionStyle>
 Rhino.DocObjects.Tables.DimStyleTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class DimStyleTable : RhinoDocCommonTable<DimensionStyle>,
	ICollection<DimensionStyle>, IEnumerable<DimensionStyle>, IEnumerable
Public NotInheritable Class DimStyleTable
	Inherits RhinoDocCommonTable(Of DimensionStyle)
	Implements ICollection(Of DimensionStyle), IEnumerable(Of DimensionStyle),
	IEnumerable
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default AnnotationStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of dimstyles in the table.
Current
CurrentId
CurrentIndex
Document
Document that owns this dimstyle table.
Item
Top
Methods
Name | Description
Add(String)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
Delete(DimensionStyle)
 Removes an annotation style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find(Guid, Boolean)
Find(String, Boolean)
FindRoot
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
GetUnusedStyleName()
 Get a unique name for a style that does not already exist in the DimStyle table
GetUnusedStyleName(String)
 Get a unique name for a dimension style that does not already exist in the DimStyle table
Modify(DimensionStyle, AnnotationBase)
Modify(DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
Modify(DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
SetCurrent
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace