RhinoCommon SDK
RadialDimension Class
 Represents a dimension of a circular entity that can be measured with radius or diameter.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.RadialDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class RadialDimension : Dimension
<SerializableAttribute>
Public Class RadialDimension
	Inherits Dimension
The RadialDimension type exposes the following members.
Constructors
Name | Description
RadialDimension()
Initializes a new instance of the RadialDimension class
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderContentAngleStyle
LeaderCurveStyle
RadiusPoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace