RhinoCommon SDK
RenderPanelType Enumeration
 Contains the custom user interfaces that may be provided
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RenderPanelType
Public Enumeration RenderPanelType
Members
Member name | Value | Description
RenderWindow | 0 |  A custom control panel added to the render output window.
See Also
Reference
Rhino.Render Namespace