RhinoCommon SDK
Font.FontStyle Enumeration
 Vertical angle of font Upright, Italic, or Oblique
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum FontStyle
Public Enumeration FontStyle
Members
Member name | Value | Description
Unset | 0 |  Not set.
Upright | 1 |  Default font style.
Italic | 2
Oblique | 3
See Also
Reference
Rhino.DocObjects Namespace