RhinoCommon SDK
OrdinateDimension Class
 Represents an ordinate dimension. ON_V6_DimOrdinate
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.OrdinateDimension
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class OrdinateDimension : Dimension
<SerializableAttribute>
Public Class OrdinateDimension
	Inherits Dimension
The OrdinateDimension type exposes the following members.
Constructors
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace