RhinoCommon SDK
ModifierKey Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ModifierKey"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[FlagsAttribute]
public enum ModifierKey
<FlagsAttribute>
Public Enumeration ModifierKey
Members
Member name | Value | Description
None | 0
Control | 1
Shift | 2
See Also
Reference
Rhino.UI Namespace