RhinoCommon SDK
LinearDimension Class
 Represents a linear dimension. ON_V6_DimLinear
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.LinearDimension
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class LinearDimension : Dimension
<SerializableAttribute>
Public Class LinearDimension
	Inherits Dimension
The LinearDimension type exposes the following members.
Constructors
Name | Description
LinearDimension()
Initializes a new instance of the LinearDimension class
LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
ArrowPoint1
ArrowPoint2
DefPoint1
DefPoint2
DimlinePoint
Top
Methods
Name | Description
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace