RhinoCommon SDK
DimensionStyle.ContentAngleStyle Enumeration
 Angle for text or other leader content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ContentAngleStyle
Public Enumeration ContentAngleStyle
Members
Member name | Value | Description
Horizontal | 0 |  Horizontal in coordinate system
Aligned | 1 |  Aligned with last leader direction
Rotated | 2 |  Explicit angle
HorizontalToScreen | 3 |  Stays horizontal and front facing
See Also
Reference
Rhino.DocObjects Namespace