RhinoCommon SDK
RealtimeDisplayModeClassInfo Class
 Class information obligatory for registering RealtimeDisplayMode implementations.
Inheritance Hierarchy
System.Object
 Rhino.Render.RealtimeDisplayModeClassInfo
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RealtimeDisplayModeClassInfo
Public MustInherit Class RealtimeDisplayModeClassInfo
The RealtimeDisplayModeClassInfo type exposes the following members.
Constructors
Name | Description
RealtimeDisplayModeClassInfo
Initializes a new instance of the RealtimeDisplayModeClassInfo class
Top
Properties
Name | Description
GUID
 Get the RealtimeDisplayMode implementation GUID
Name
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
RealtimeDisplayModeType
 Get the type being registered.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace