RhinoCommon SDK
AnnotationObjectBase Class
 Base class for all annotation objects (text and dimensions)
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.DimensionObject
 Rhino.DocObjects.LeaderObject
 Rhino.DocObjects.TextObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class AnnotationObjectBase : RhinoObject
Public Class AnnotationObjectBase
	Inherits RhinoObject
The AnnotationObjectBase type exposes the following members.
Properties
Name | Description
DisplayText
 Gets the text that is displayed to users.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
AnnotationGeometry
 utility function to be replaced after a proper V6 AnnotationObjectBase is added
DimScale
 I really would like to change the name of this function to something more descriptive
GetArrowHeadCorners2d
 Get the corners of a polygon that contains the arrowhead
GetArrowHeadCorners3d
 Get the corners of a polygon that contains the arrowhead
GetTextXform
Top
See Also
Reference
Rhino.DocObjects Namespace