RhinoCommon SDK
RenderTexture Class
[Missing <summary> documentation for "T:Rhino.Render.RenderTexture"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContent
 Rhino.Render.RenderTexture
 Rhino.Render.TwoColorRenderTexture
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RenderTexture : RenderContent
Public MustInherit Class RenderTexture
	Inherits RenderContent
The RenderTexture type exposes the following members.
Constructors
Name | Description
RenderTexture
Initializes a new instance of the RenderTexture class
Top
Properties
Name | Description
LocalMappingTransform
 Gets the transformation that can be applied to the UVW vector to convert it from normalized texture space into locally mapped space (ie - with repeat, offset and rotation applied.)
RenderHashWithoutLocalMapping
 Render hash for texture excluding local mapping.
Top
Methods
Name | Description
CreateEvaluator() |  Obsolete.
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
CreateEvaluator(RenderTexture.TextureEvaluatorFlags)
 Constructs a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline.
GetDisplayInViewport
GetEnvironmentMappingMode
GetEnvironmentMappingProjection
GetInternalEnvironmentMappingMode
GetMappingChannel
GetOffset
 Get offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
GetOffsetLocked
GetPreviewIn3D
GetPreviewLocalMapping
GetProjectionMode
GetRepeat
 Get repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
GetRepeatLocked
GetRotation
GetWcsBoxMapping
GetWrapType
IsHdrCapable
IsLinear
NewBitmapTexture
 Constructs a new basic texture from a SimulatedTexture.
PixelSize
 Get the texture dimensions for the RenderTexture.
SetDisplayInViewport(Boolean)
SetDisplayInViewport(Boolean, RenderContent.ChangeContexts)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
SetMappingChannel
SetOffset
 Set offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
SetOffsetLocked
SetPreviewIn3D
SetPreviewLocalMapping(Boolean)
SetPreviewLocalMapping(Boolean, RenderContent.ChangeContexts)
SetProjectionMode
SetRepeat
 Set repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
SetRepeatLocked
SetRotation
SetWrapType
SimulatedTexture
SimulateTexture(SimulatedTexture, Boolean) |  Obsolete.
SimulateTexture(SimulatedTexture, RenderTexture.TextureGeneration, Int32, RhinoObject)
Top
See Also
Reference
Rhino.Render Namespace