RhinoCommon SDK
PreviewLighting Class
 PreviewAppearance takes care of constucting and desctrutction of PreviewLight
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewLighting
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class PreviewLighting
Public Class PreviewLighting
The PreviewLighting type exposes the following members.
Constructors
Name | Description
PreviewLighting
 Constructor for PreivewLighting
Top
Properties
Name | Description
CppPointer
 CppPointer for PreivewLighting
Top
Methods
Name | Description
ElementKind
 ElementKind
SetUpPreview
 SetUpPreview
Top
See Also
Reference
Rhino.Render Namespace