RhinoCommon SDK
RenderContent.MatchDataResult Enumeration
 Return values for MatchData function
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum MatchDataResult
Public Enumeration MatchDataResult
Members
Member name | Value | Description
None | 0
Some | 1
All | 2
See Also
Reference
Rhino.Render Namespace