RhinoCommon SDK
AnnotationExtensions Class
[Missing <summary> documentation for "T:Rhino.Geometry.AnnotationExtensions"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.AnnotationExtensions
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static class AnnotationExtensions
<ExtensionAttribute>
Public NotInheritable Class AnnotationExtensions
The AnnotationExtensions type exposes the following members.
Methods
Name | Description
SetDefaultContext
Top
See Also
Reference
Rhino.Geometry Namespace