RhinoCommon SDK
TextureRenderHashFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureRenderHashFlags"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureRenderHashFlags
Public Enumeration TextureRenderHashFlags
Members
Member name | Value | Description
ExcludeLocalMapping | 1
See Also
Reference
Rhino.Render Namespace