RhinoCommon SDK
Dimension.ForceArrow Enumeration
 Arrowheads forced Inside, or Outside of extension lines, or moved to fit.
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ForceArrow
Public Enumeration ForceArrow
Members
Member name | Value | Description
Auto | 0
Inside | 1
Outside | 2
See Also
Reference
Rhino.Geometry.V6Annotation Namespace