RhinoCommon SDK
TextRunType Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.V6Annotation.TextRunType"]
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextRunType
Public Enumeration TextRunType
Members
Member name | Value | Description
None | 0
Text | 1
Newline | 2
Paragraph | 3
Column | 4
Field | 5
Fontdef | 6
Header | 7
See Also
Reference
Rhino.Geometry.V6Annotation Namespace