RhinoCommon SDK
RealtimeDisplayMode Class
 Base class for implementing real-time display modes in .NET
Inheritance Hierarchy
System.Object
 Rhino.Render.RealtimeDisplayMode
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RealtimeDisplayMode
Public MustInherit Class RealtimeDisplayMode
The RealtimeDisplayMode type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode
Initializes a new instance of the RealtimeDisplayMode class
Top
Methods
Name | Description
CaptureProgress
CreateWorld
GetRealtimeViewport(IntPtr)
GetRealtimeViewport(IntPtr, Boolean)
GetRenderSize
GetView
 Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
HudAllowEditMaxPasses
HudLastRenderedPass
HudMaximumPasses
HudProductName
HudRendererLocked
HudRendererPaused
HudShow
HudShowControls
 Show control buttons on the realtime display HUD. By default these are shown, override this function and return false if HUD controls aren't needed.
HudShowMaxPasses
HudShowPasses
HudShowStatusText
HudStartTime
HudStatusText
IsCompleted
 Implement to tell if your render engine has completed a frame for drawing into the viewport
IsFrameBufferAvailable
 Implement to tell the render pipeline that a framebuffer is ready
IsRendererStarted
 Override to tell the started state of your render engine.
LastRenderedPass
OnRenderSizeChanged
 Override to restart your render engine
RegisterDisplayModes(PlugIn)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in.
RegisterDisplayModes(Assembly, Guid)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
RemoveRealtimeViewport
SetGamma
 Set gamma for this RealtimeDisplayMode
SetUseLinearWorkflowGamma
 Set whether linear workflow is used.
SetView
 Set ViewInfo for this RealtimeDisplayMode instance.
ShowCaptureProgress
ShutdownRenderer
 Override to shutdown your render engine
SignalRedraw
 Use to signal the underlying pipeline a redraw is wanted. This can be used for instance when a renderer has completed a pass which should be updated in the associated viewport.
StartRenderer
 Override to start your render engine
Top
Events
Name | Description
HudLockButtonPressed
HudPauseButtonPressed
HudPlayButtonPressed
HudUnlockButtonPressed
MaxPassesChanged
OnDisplayPipelineSettingsChanged
OnDrawMiddleground
OnInitFramebuffer
Top
See Also
Reference
Rhino.Render Namespace