RhinoCommon SDK
RdkViewModel.Factory Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.RdkViewModel.Factory"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.UI.Controls.RdkViewModel.Factory
 Rhino.UI.Controls.ThumbnailViewModelFactory
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Factory : FactoryBase
Public Class Factory
	Inherits FactoryBase
The RdkViewModel.Factory type exposes the following members.
Constructors
Name | Description
RdkViewModel.Factory
Initializes a new instance of the RdkViewModel.Factory class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace