RhinoCommon SDK
TextHorizontalAlignment Enumeration
 Horizontal location of text attach point relative to text
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextHorizontalAlignment
Public Enumeration TextHorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Attach at left of text
Center | 1 |  Attach point at center of text
Right | 2 |  Attach point at right of text
See Also
Reference
Rhino.DocObjects Namespace