RhinoCommon SDK
Dimension Class
 Base class for dimensions
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.Centermark
 Rhino.Geometry.OrdinateDimension
 Rhino.Geometry.RadialDimension
 Rhino.Geometry.V6Annotation.AngularDimension
 Rhino.Geometry.V6Annotation.LinearDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public abstract class Dimension : AnnotationBase
<SerializableAttribute>
Public MustInherit Class Dimension
	Inherits AnnotationBase
The Dimension type exposes the following members.
Constructors
Name | Description
Dimension()
Initializes a new instance of the Dimension class
Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Top
Properties
Name | Description
AlternateBelowLine
AltLengthFactor
AltLengthFormat
AltLengthResolution
AltLengthRoundoff
AltPrefix
AltSuffix
AltUnitsDisplay
AltZeroSuppression
ArrowBlockId1
ArrowBlockId2
ArrowheadType1
ArrowheadType2
ArrowSize
BaselineSpacing
CentermarkSize
CentermarkStyle
DetailMeasured
DimensionLineExtension
DimensionTextPlacement
DistanceScale
ExtensionLineExtension
ExtensionLineOffset
FixedExtensionLength
FixedLengthExtensionOn
LengthFactor
LengthFormat
LengthResolution
LengthRoundoff
Measurement
Prefix
Suffix
SuppressExtension1
SuppressExtension2
TextFormula
TextRotation
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
UseDefaultTextPoint
ZeroSuppression
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace