RhinoCommon SDK
Font Class
Defines a format for text.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class Font
Public NotInheritable Class Font
The Font type exposes the following members.
Constructors
Name | Description
Font(String)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
Top
Properties
Name | Description
Bold
FaceName
Italic
Strikeout
Style
Underlined
Weight
Top
Methods
Name | Description
AvailableFontFaceNames
Top
See Also
Reference
Rhino.DocObjects Namespace