RhinoCommon SDK
ThumbnailListImpl Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailListImpl"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.ThumbnailListImpl
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ThumbnailListImpl : IDisposable
Public NotInheritable Class ThumbnailListImpl
	Implements IDisposable
The ThumbnailListImpl type exposes the following members.
Constructors
Name | Description
ThumbnailListImpl
Initializes a new instance of the ThumbnailListImpl class
Top
Properties
Name | Description
CppPointer
ViewModel
Top
Methods
Name | Description
Dispose
Releases all resources used by the ThumbnailListImpl
Find
Get
NewNativeWrapper
Top
Events
Name | Description
DataChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace