RhinoCommon SDK
DimensionStyle.VerticalAlignment Enumeration
 Attachment of content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum VerticalAlignment
Public Enumeration VerticalAlignment
Members
Member name | Value | Description
Centered | 0 |  Text centered on dimension line (does not apply to leaders or text)
Above | 1 |  Text above dimension line (does not apply to leaders or text)
Below | 2 |  Text below dimension line (does not apply to leaders or text)
Top | 3 |  Leader tail at top of text (does not apply to text or dimensions)
FirstLine | 4 |  Leader tail at middle of first text line (does not apply to text or dimensions)
Middle | 5 |  Leader tail at middle of text or content (does not apply to text or dimensions)
LastLine | 6 |  Leader tail at middle of last text line (does not apply to text or dimensions)
Bottom | 7 |  Leader tail at bottom of text (does not apply to text or dimensions)
Underlined | 8 |  Leader tail at bottom of text, text underlined (does not apply to text or dimensions)
See Also
Reference
Rhino.DocObjects Namespace