RhinoCommon SDK
ThumbnailListImpl.CREATEFROMCPPPROC Delegate
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailListImpl.CREATEFROMCPPPROC"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public delegate IntPtr CREATEFROMCPPPROC(
	IntPtr hwndParent,
	IntPtr cec,
	int tree_mode
)
Public Delegate Function CREATEFROMCPPPROC (
	hwndParent As IntPtr,
	cec As IntPtr,
	tree_mode As Integer
) As IntPtr
Parameters
hwndParent
Type: System.IntPtr
cec
Type: System.IntPtr
tree_mode
Type: System.Int32
Return Value
Type: IntPtr
See Also
Reference
Rhino.UI.Controls Namespace