RhinoCommon SDK
File3dmInstanceDefinitionTable Class
 Provides access to instance (block) definitions in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<InstanceDefinitionGeometry>
 Rhino.FileIO.File3dmCommonComponentTable<InstanceDefinitionGeometry>
 Rhino.FileIO.File3dmInstanceDefinitionTable
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class File3dmInstanceDefinitionTable : File3dmCommonComponentTable<InstanceDefinitionGeometry>,
	IList<InstanceDefinitionGeometry>, ICollection<InstanceDefinitionGeometry>, IEnumerable<InstanceDefinitionGeometry>,
	IEnumerable
Public Class File3dmInstanceDefinitionTable
	Inherits File3dmCommonComponentTable(Of InstanceDefinitionGeometry)
	Implements IList(Of InstanceDefinitionGeometry), ICollection(Of InstanceDefinitionGeometry),
	IEnumerable(Of InstanceDefinitionGeometry), IEnumerable
The File3dmInstanceDefinitionTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindName
 Finds an InstanceDefinitionGeometry given its name.
FindNameHash
 Finds a InstanceDefinitionGeometry given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace