RhinoCommon SDK
Arrowhead Class
 Arrowhead used by annotation
Inheritance Hierarchy
System.Object
 Rhino.Geometry.V6Annotation.Arrowhead
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Arrowhead
Public Class Arrowhead
The Arrowhead type exposes the following members.
Constructors
Name | Description
Arrowhead()
 Constructor
Arrowhead(DimensionStyle.ArrowType, Guid)
 Constructor
Top
Properties
Name | Description
ArrowType
 Type of arrowhead used by annotation
BlockId
 Id of block used for user-defined arrowhead
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace