RhinoCommon SDK
LinearWorkflow Class
 This is the interface to linear workflow settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.LinearWorkflow
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class LinearWorkflow : DocumentOrFreeFloatingBase
Public NotInheritable Class LinearWorkflow
	Inherits DocumentOrFreeFloatingBase
The LinearWorkflow type exposes the following members.
Properties
Name | Description
Enabled
 Linear workflow active state
Gamma
 Linear workflow gamma
Hash
 Linear workflow CRC
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace