RhinoCommon SDK
InvalidDimensionStyleIdException Class
[Missing <summary> documentation for "T:Rhino.Geometry.InvalidDimensionStyleIdException"]
Inheritance Hierarchy
System.Object
 System.Exception
 System.SystemException
 System.InvalidOperationException
 Rhino.Geometry.InvalidDimensionStyleIdException
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class InvalidDimensionStyleIdException : InvalidOperationException
Public Class InvalidDimensionStyleIdException
	Inherits InvalidOperationException
The InvalidDimensionStyleIdException type exposes the following members.
Constructors
Name | Description
InvalidDimensionStyleIdException
Initializes a new instance of the InvalidDimensionStyleIdException class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace