RhinoCommon SDK
AnnotationType Enumeration
 ON::AnnotationType identifies the type of an annotation object derived from ON_V6_Annotation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum AnnotationType
Public Enumeration AnnotationType
Members
Member name | Value | Description
Unset | 0 |  Not a valid annotation tye. This encourages developers to thoughtfully initialize ON_SubDVertex::m_vertex_tag.
Aligned | 1 |  Linear distance between two points with dimension line parallel to the dimensioned points.
Angular | 2 |  Angle bewteen two lines.
Diameter | 3 |  Arc or circle diameter dimension.
Radius | 4 |  Arc or circle radius dimension.
Rotated | 5 |  Linear distance between two points with dimension line horizontal, vertical or rotated by a specified amount.
Ordinate | 6 |  Ordinate dimension. Typically used to document an offset distance between the center of a circle and a reference point.
ArcLen | 7 |  Arc length of a curve.
CenterMark | 8 |  Center mark dimension. Typically used to document the center of an arc or circle.
Text | 9 |  Text. Stand along text with a wide variety of uses.
Leader | 10 |  Leader. Text and a curve with an arrow head.
See Also
Reference
Rhino.Geometry Namespace