RhinoCommon SDK
ViewCapture Class
[Missing <summary> documentation for "T:Rhino.Display.ViewCapture"]
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCapture
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ViewCapture
Public Class ViewCapture
The ViewCapture type exposes the following members.
Constructors
Name | Description
ViewCapture
Initializes a new instance of the ViewCapture class
Top
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
ScaleScreenItems
TransparentBackground
Width
Top
Methods
Name | Description
CaptureToBitmap
CaptureToSvg
Top
See Also
Reference
Rhino.Display Namespace