RhinoCommon SDK
Components Class
 Provides access to all Grasshopper runtime components.
Inheritance Hierarchy
System.Object
 Rhino.Grasshopper.Components
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class Components
Public MustInherit Class Components
The Components type exposes the following members.
Constructors
Name | Description
Components
Initializes a new instance of the Components class
Top
Properties
Name | Description
NodeInCodeFunctions
 Returns a collection with all component functions.
Top
Methods
Name | Description
GetAllFunctions
 Returns a collection with all component functions. For infrastructure usage only.
Top
See Also
Reference
Rhino.Grasshopper Namespace