RhinoCommon SDK
DocumentOrFreeFloatingBase Class
[Missing <summary> documentation for "T:Rhino.Render.DocumentOrFreeFloatingBase"]
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
 Rhino.Render.GroundPlane
 Rhino.Render.LinearWorkflow
 Rhino.Render.Skylight
 Rhino.Render.Sun
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class DocumentOrFreeFloatingBase : FreeFloatingBase
Public MustInherit Class DocumentOrFreeFloatingBase
	Inherits FreeFloatingBase
The DocumentOrFreeFloatingBase type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace