RhinoCommon SDK
TextEntity Class
[Missing <summary> documentation for "T:Rhino.Geometry.TextEntity"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.TextEntity
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization
Top
Properties
Name | Description
Justification
 Gets or sets the justification of text in relation to its base point.
TextHorizontalAlignment
TextVerticalAlignment
Top
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
GetTextTransform
 Get the transform for this text object's text geometry
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace