RhinoCommon SDK
RenderWindow.StandardChannels Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.StandardChannels"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[FlagsAttribute]
public enum StandardChannels
<FlagsAttribute>
Public Enumeration StandardChannels
Members
Member name | Value | Description
None | 0
Red | 1
Green | 2
Blue | 4
Alpha | 8
RGBA | 15
DistanceFromCamera | 16
NormalX | 32
NormalY | 64
NormalZ | 128
LuminanceRed | 256
LuminanceGreen | 512
LuminanceBlue | 1024
BackgroundLuminanceRed | 4096
BackgroundLuminanceGreen | 8192
BackgroundLuminanceBlue | 16384
MaterialIds | 65536
ObjectIds | 131072
Wireframe | 262144
See Also
Reference
Rhino.Render Namespace