RhinoCommon SDK
PointStyle Enumeration
 Defines styles used for drawing points.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PointStyle
Public Enumeration PointStyle
Members
Member name | Value | Description
Simple | 0 |  Square
ControlPoint | 1 |  Square with white center
ActivePoint | 2 |  Like a control point but includes vertical/horizontal crosshair lines.
X | 3 |  X shape
RoundSimple | 4 |  Circular
RoundControlPoint | 5 |  Circular with white center
RoundActivePoint | 6 |  Round control point with crosshair lines
Circle | 4 |  Circle or ring shape when inner diameter is set
Square | 0 |  Square or diamond shape when rotated
Triangle | 7 |  Triangular shape
Heart | 8 |  Heart shape
Chevron | 9 |  Chevron shape (two directional arrows)
Clover | 10 |  Three unioned circles
Tag | 11 |  Tag shape
Asterisk | 12 |  * shape
Pin | 13 |  Map style pin symbol
Arrow | 14 |  Basic arrow shape
See Also
Reference
Rhino.Display Namespace