RhinoCommon SDK
DimensionStyle.LeaderContentAngleStyle Enumeration
 Angle for text or other leader or dimension content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderContentAngleStyle
Public Enumeration LeaderContentAngleStyle
Members
Member name | Value | Description
Horizontal | 0 |  Horizontal in coordinate system
Aligned | 1 |  Aligned with last leader direction or dimension line
Rotated | 2 |  Explicit angle
See Also
Reference
Rhino.DocObjects Namespace