RhinoCommon SDK
OrdinateDimension.MeasuredDirection Enumeration
 Ordinate dimension measures x or y direction
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum MeasuredDirection
Public Enumeration MeasuredDirection
Members
Member name | Value | Description
Unset | 0
Xaxis | 1 |  Measures horizontal distance
Yaxis | 2 |  Measures vertical distance
See Also
Reference
Rhino.Geometry.V6Annotation Namespace