RhinoCommon SDK
Centermark Class
 Represents a centermark. ON_V6_Centermark
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.Dimension
 Rhino.Geometry.V6Annotation.Centermark
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class Centermark : Dimension
<SerializableAttribute>
Public Class Centermark
	Inherits Dimension
The Centermark type exposes the following members.
Constructors
Name | Description
Centermark()
Initializes a new instance of the Centermark class
Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
GetDisplayLines
Top
Fields
Name | Description
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace