RhinoCommon SDK
TextEntity Class
[Missing <summary> documentation for "T:Rhino.Geometry.V6Annotation.TextEntity"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.V6Annotation.TextEntity
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace