RhinoCommon SDK
ActiveSpace Enumeration
Defines the current working space.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ActiveSpace
Public Enumeration ActiveSpace
Members
Member name | Value | Description
None | 0 | There is no working space.
ModelSpace | 1 | 3d modeling or "world" space.
PageSpace | 2 | page/layout/paper/printing space.
See Also
Reference
Rhino.DocObjects Namespace