RhinoCommon SDK
CollapsibleSectionHolderImpl.CREATEFROMCPPPROC Delegate
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionHolderImpl.CREATEFROMCPPPROC"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public delegate IntPtr CREATEFROMCPPPROC(
	IntPtr hwndParent
)
Public Delegate Function CREATEFROMCPPPROC (
	hwndParent As IntPtr
) As IntPtr
Parameters
hwndParent
Type: System.IntPtr
Return Value
Type: IntPtr
See Also
Reference
Rhino.UI.Controls Namespace