RhinoCommon SDK
DimensionStyle.Field Enumeration
 Field identifiers used for file i/o and getting/setting values
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum Field
Public Enumeration Field
Members
Member name | Value | Description
Unset | 0
Name | 1 | Dimension style Name property. Cannot be inherited from parent.
Index | 2 | Dimension style runtime model component index property. Cannot be inherited from parent.
ExtensionLineExtension | 3
ExtensionLineOffset | 4
Arrowsize | 5
LeaderArrowsize | 6
Centermark | 7
TextGap | 8
TextHeight | 9
TextAlignment | 10
LengthFormat | 11
LengthResolution | 12
AngleFormat | 13
AngleResolution | 14
Font | 15
LengthFactor | 16
Alternate | 17
AlternateLengthFactor | 18
AlternateLengthFormat | 19
AlternateLengthResolution | 20
Prefix | 21
Suffix | 22
AlternatePrefix | 23
AlternateSuffix | 24
DimensionLineExtension | 25
SuppressExtension1 | 26
SuppressExtension2 | 27
ExtLineColorSource | 28
DimLineColorSource | 29
ArrowColorSource | 30
TextColorSource | 31
ExtLineColor | 32
DimLineColor | 33
ArrowColor | 34
TextColor | 35
ExtLinePlotColorSource | 36
DimLinePlotColorSource | 37
ArrowPlotColorSource | 38
TextPlotColorSource | 39
ExtLinePlotColor | 40
DimLinePlotColor | 41
ArrowPlotColor | 42
TextPlotColor | 43
ExtLinePlotWeightSource | 44
DimLinePlotWeightSource | 45
ExtLinePlotWeight_mm | 46
DimLinePlotWeight_mm | 47
ToleranceFormat | 48
ToleranceResolution | 49
ToleranceUpperValue | 50
ToleranceLowerValue | 51
AltToleranceResolution | 52
ToleranceHeightScale | 53
BaselineSpacing | 54
DrawMask | 55
MaskColorSource | 56
MaskColor | 57
MaskBorder | 58
DimensionScale | 59
DimscaleSource | 60
FixedExtensionLength | 61
FixedExtensionOn | 62
TextRotation | 63
SuppressArrow1 | 64
SuppressArrow2 | 65
TextmoveLeader | 66
ArclengthSymbol | 67
StackTextheightScale | 68
StackFormat | 69
AltRound | 70
Round | 71
AngularRound | 72
AltZeroSuppress | 73
ToleranceZeroSuppress | 74
AngleZeroSuppress | 75
ZeroSuppress | 76
AltBelow | 77
ArrowType1 | 78
ArrowType2 | 79
LeaderArrowType | 80
ArrowBlockId1 | 81
ArrowBlockId2 | 82
LeaderArrowBlock | 83
LdrContentType | 84
TextVerticalAlignment | 85
LdrVerticalAlignment | 86
ContentAngleStyle | 87
LdrCurveType | 88
LeaderContentAngle | 89
LeaderHasLanding | 90
LeaderLandingLength | 91
MaskFlags | 92
CentermarkStyle | 93
TextHorizontalAlignment | 94
LeaderHorizontalAlignment | 95
DrawForward | 96
SignedOrdinate | 97
UnitSystem | 98
TextMask | 99
Count | 100 | Every enum UINT value that identifies a valid dimension style property is less than the UINT value of Count.
See Also
Reference
Rhino.DocObjects Namespace