RhinoCommon SDK
ViewCaptureSettings Class
 Used to hold the information required to generate high resolution output of a RhinoViewport. This is used for generating paper prints or image files
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCaptureSettings
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ViewCaptureSettings : IDisposable
Public Class ViewCaptureSettings
	Implements IDisposable
The ViewCaptureSettings type exposes the following members.
Constructors
Name | Description
ViewCaptureSettings
Initializes a new instance of the ViewCaptureSettings class
Top
Properties
Name | Description
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DrawAxis
DrawBackground
DrawGrid
DrawLockedObjects
IsValid
Resolution
 Capture "density" in dots per inch
Size
 Total size of the image or page in dots
Top
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Display Namespace