RhinoCommon SDK
NodeInCodeTable Class
 Permits rapid access to references to all Grasshopper functions.
Inheritance Hierarchy
System.Object
 System.Dynamic.DynamicObject
 Rhino.Grasshopper.NodeInCodeTable
Namespace: Rhino.Grasshopper
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class NodeInCodeTable : DynamicObject
Public Class NodeInCodeTable
	Inherits DynamicObject
The NodeInCodeTable type exposes the following members.
Constructors
Name | Description
NodeInCodeTable
 Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
Top
Methods
Name | Description
GetDynamicMemberNames
 Returns all additional names in the table.
 (Overrides DynamicObject.GetDynamicMemberNames().)
TryGetIndex
 Gets the ComponentFunctionInfo at
 (Overrides DynamicObject.TryGetIndex(GetIndexBinder, Object[], Object).)
TryGetMember
 Dynamically binds the table to property-like access via its item names.
 (Overrides DynamicObject.TryGetMember(GetMemberBinder, Object).)
TryInvokeMember
 Dynamically invokes a member of the table.
 (Overrides DynamicObject.TryInvokeMember(InvokeMemberBinder, Object[], Object).)
Top
See Also
Reference
Rhino.Grasshopper Namespace