RhinoCommon SDK
ZBiasMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ZBiasMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ZBiasMode
Public Enumeration ZBiasMode
Members
Member name | Value | Description
Neutral | 0
TowardsCamera | 1
AwayFromCamera | 2
See Also
Reference
Rhino.Display Namespace