RhinoCommon SDK
CustomGripObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomGripObject"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.Custom.CustomGripObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class CustomGripObject : GripObject,
	IDisposable
Public Class CustomGripObject
	Inherits GripObject
	Implements IDisposable
The CustomGripObject type exposes the following members.
Constructors
Name | Description
CustomGripObject
Initializes a new instance of the CustomGripObject class
Top
Properties
Name | Description
Index
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
OriginalLocation
Weight |  (Overrides GripObject.Weight.)
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomGripObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
NewLocation
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace