RhinoCommon SDK
AnnotationBase Class
 Provides a common base class to all annotation geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Annotation.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.V6Annotation.Leader
 Rhino.Geometry.V6Annotation.TextEntity
Namespace: Rhino.Geometry.V6Annotation
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AnnotationBase : GeometryBase
<SerializableAttribute>
Public Class AnnotationBase
	Inherits GeometryBase
The AnnotationBase type exposes the following members.
Constructors
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DimensionScale
DimensionStyle
DimensionStyleId
 Id of this annotation's prent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
DrawForward
DrawTextMask
Font
FormatWidth
 Text format width (Wrapping rectangle)
GetDimstyle
GetModelUnits
HasPropertyOverrides
MaskColor
MaskColorSource
MaskOffset
ParentDimensionStyle
PlainText
 Text stripped of RTF formatting information
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextHeight
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
TextIsWrapped
 Is text wrapping on
TextRotationDegrees
 Rotation of text in degrees
TextRotationRadians
 Rotation of text in radians
Top
Methods
Name | Description
ClearOverrideDimStyle
 Clear the override DimensionStyle for this annotation object, reverting to using the parent style for all properties
ClearPropertyOverrides
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
IsPropertyOverridden
SetContext
 This function would not be called outside of Rhino but it is written this way not to couple this class with RhinoDoc. If you're thinking of calling this method from the Rhino context you should call the SetDefaultContext() extension method (AnnotationExtensions.cs)
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensinoStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
WrapText
 Wrap text
Top
Fields
Name | Description
m_doc_serialnumber
Top
Extension Methods
Name | Description
SetDefaultContext |  (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry.V6Annotation Namespace