RhinoCommon SDK
FileFindPreference Enumeration
Defines options for file search.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum FileFindPreference
Public Enumeration FileFindPreference
Members
Member name | Value | Description
None | 0 | The choice is not defined.
FullPath | 1 | File name exists in FullPath().
RelativePath | 2 | File name exists in base path + RelativePath().
BasePath | 3 | File name exists in base path directory.
ContentMatch | 4 | File with mathing content exists.
MostRecent | 5 | Most recently modifed file.
See Also
Reference
Rhino.FileIO Namespace