RhinoCommon SDK
Dithering Class
 This is the interface to linear workflow settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class Dithering : DocumentOrFreeFloatingBase
Public NotInheritable Class Dithering
	Inherits DocumentOrFreeFloatingBase
The Dithering type exposes the following members.
Properties
Name | Description
Method
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace