RhinoCommon SDK
CreatePreviewReason Enumeration
 Reason the content preview is being generated
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum CreatePreviewReason
Public Enumeration CreatePreviewReason
Members
Member name | Value | Description
ContentChanged | 0
ViewChanged | 1
RefreshDisplay | 2
Other | 99
See Also
Reference
Rhino.Render Namespace