RhinoCommon SDK
FilePdf Class
 Support for PDF file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePdf
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class FilePdf
Public MustInherit Class FilePdf
The FilePdf type exposes the following members.
Constructors
Name | Description
FilePdf
Initializes a new instance of the FilePdf class
Top
Methods
Name | Description
AddPage
 Add a new page to this document
Create
 Create a new instance of a FilPdf class
Write(Stream)
 Write pdf to a stream
Write(String)
 Write pdf to a file
Top
See Also
Reference
Rhino.FileIO Namespace