RhinoCommon SDK
CustomRenderContentAttribute Class
[Missing <summary> documentation for "T:Rhino.Render.CustomRenderContentAttribute"]
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.Render.CustomRenderContentAttribute
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class CustomRenderContentAttribute : Attribute
Public NotInheritable Class CustomRenderContentAttribute
	Inherits Attribute
The CustomRenderContentAttribute type exposes the following members.
Constructors
Name | Description
CustomRenderContentAttribute
Initializes a new instance of the CustomRenderContentAttribute class
Top
Properties
Name | Description
Category
ImageBased
IsBuiltIn
IsElevated
IsPrivate
RenderEngineId
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace